Computer Science/C Notes/C_notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-08-27 Tue 18:50 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org7053e66">1. Generals</a>
<ul>
<li><a href="#orgeb5e6cd">1.1. Some Facts</a></li>
<li><a href="#org5d85de7">1.2. headers</a></li>
<li><a href="#orga5ece1e">1.3. <code>printf()</code> formatting</a></li>
<li><a href="#org4caff2e">1.4. Character Input and Output</a></li>
<li><a href="#org778e16a">1.5. Arrays</a></li>
<li><a href="#org9d7d979">1.6. Enumeration constant</a></li>
<li><a href="#orgb1e31e9">1.7. type-cast an expression</a></li>
<li><a href="#orge1f128f">1.8. Bitwise operators</a></li>
<li><a href="#org250705c">1.9. Operators can be used with assignment operators</a></li>
<li><a href="#orgd370d06">1.10. Symbolic Constants</a></li>
</ul>
</li>
<li><a href="#orge4a342d">2. Functions and Program Structure</a>
<ul>
<li><a href="#org03e259d">2.1. External Variables</a></li>
<li><a href="#orgff39cf2">2.2. The C Preprocessor</a>
<ul>
<li><a href="#org42ff3dc">2.2.1. File Inclusion</a></li>
<li><a href="#org6800269">2.2.2. Macro Substitution</a>
<ul>
<li><a href="#orgb8310ed">2.2.2.1. General</a></li>
<li><a href="#orgde403df">2.2.2.2. Arguments</a></li>
<li><a href="#orgdbb2f0c">2.2.2.3. Pitfalls</a></li>
</ul>
</li>
<li><a href="#org68a42dd">2.2.3. Conditional Inclusion</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org5814482">3. Pointers and Arrays</a>
<ul>
<li><a href="#orgf44a5f8">3.1. Command-line Arguments</a>
<ul>
<li><a href="#org9dd88e2">3.1.1. Example: <code>echo</code></a></li>
<li><a href="#org883176b">3.1.2. Example: <code>pattern_finding</code></a></li>
<li><a href="#org3477efa">3.1.3. Optional arguments example: <code>pattern_finding</code> extended</a></li>
</ul>
</li>
<li><a href="#org3c67c14">3.2. Pointers to Functions</a>
<ul>
<li><a href="#org39b4442">3.2.1. Example: qsort() which takes a comp() function pointer</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org35431ff">4. Input and Output</a>
<ul>
<li><a href="#org97c153e">4.1. Standard Input and Output</a>
<ul>
<li><a href="#org90f3c71">4.1.1. Input redirection</a></li>
<li><a href="#org90b258f">4.1.2. Output redirection</a></li>
<li><a href="#org4157cfe">4.1.3. Pipe between two programs</a></li>
<li><a href="#org14b5f31">4.1.4. Include header file</a></li>
<li><a href="#orgbfce7c3">4.1.5. Macros in standard library</a></li>
<li><a href="#org6fae4bd">4.1.6. Formatted output: printf</a></li>
<li><a href="#org5d3181a">4.1.7. Function <code>sprintf()</code></a></li>
</ul>
</li>
<li><a href="#orgeea8fc6">4.2. Variable-length Argument Lists</a>
<ul>
<li><a href="#orgf1209cb">4.2.1. Declare a function that takes varying amounts of arguments</a></li>
<li><a href="#orgb44b026">4.2.2. Traverse the argument list and final cleanup</a>
<ul>
<li><a href="#org14f11a4">4.2.2.1. Type <code>va_list</code></a></li>
<li><a href="#orge9f423d">4.2.2.2. Macro <code>va_start</code></a></li>
<li><a href="#org5b272ca">4.2.2.3. Macro <code>va_arg</code></a></li>
<li><a href="#orgf3e02d7">4.2.2.4. Macro <code>va_end</code></a></li>
</ul>
</li>
<li><a href="#orgc7c1da3">4.2.3. Example: <code>miniPrintf()</code> </a></li>
</ul>
</li>
<li><a href="#org0d00566">4.3. Formated Input: <code>scanf()</code></a>
<ul>
<li><a href="#orgf23ea64">4.3.1. A simple example</a></li>
<li><a href="#orgbdebf96">4.3.2. Declaration and arguments</a></li>
</ul>
</li>
<li><a href="#org905f670">4.4. File Access</a>
<ul>
<li><a href="#org3f1c769">4.4.1. Opening a file</a></li>
<li><a href="#org1bbc8d8">4.4.2. Accessing the file</a></li>
<li><a href="#org30b38a1">4.4.3. <code>stdin</code>, <code>stdout</code> and <code>stderr</code></a></li>
<li><a href="#org22a8344">4.4.4. Formatted input and output of files</a></li>
<li><a href="#org3e888ad">4.4.5. Example: replicate program <code>cat</code></a></li>
<li><a href="#org3c0197a">4.4.6. Line input and output</a></li>
</ul>
</li>
<li><a href="#org35cbc64">4.5. MISC Functions</a>
<ul>
<li><a href="#orgd8f5399">4.5.1. Storage Management</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org58ee376">5. The UNIX System Interface</a>
<ul>
<li><a href="#orgf245e9f">5.1. File Descriptors</a></li>
<li><a href="#orga6073cf">5.2. Low Level I/O: <code>read()</code> and <code>write()</code></a>
<ul>
<li><a href="#org5542581">5.2.1. <code>read()</code></a></li>
<li><a href="#org2faabc1">5.2.2. <code>write()</code></a></li>
<li><a href="#orgbbbc964">5.2.3. Example: copy input to output</a></li>
<li><a href="#org9adde13">5.2.4. Example: <code>getchar()</code></a></li>
</ul>
</li>
<li><a href="#orgdf5ff0d">5.3. <code>open()</code>, <code>creat()</code>, <code>close()</code>, <code>unlink()</code></a>
<ul>
<li><a href="#orgb8ec0ce">5.3.1. <code>open()</code></a>
<ul>
<li><a href="#orgb51859d">5.3.1.1. Generals</a></li>
<li><a href="#org4f2ffd7">5.3.1.2. Example: open a file for reading</a></li>
</ul>
</li>
<li><a href="#org919ef90">5.3.2. <code>creat()</code></a>
<ul>
<li><a href="#org4bc1522">5.3.2.1. Generals</a></li>
</ul>
</li>
<li><a href="#org5714e4b">5.3.3. <code>close()</code></a></li>
<li><a href="#org2fa0f40">5.3.4. <code>unlink()</code></a></li>
<li><a href="#org0483087">5.3.5. Example: mini <code>cp</code> program</a></li>
<li><a href="#org6728877">5.3.6. Example: mini <code>cp</code> program with self-implemented <code>error()</code> display</a></li>
<li><a href="#org531607d">5.3.7. Exercise: mini <code>cat</code> program</a></li>
</ul>
</li>
<li><a href="#org7fa7a54">5.4. Random Access: <code>lseek()</code></a>
<ul>
<li><a href="#org31c5f1e">5.4.1. <code>lseek()</code></a></li>
<li><a href="#org61a2393">5.4.2. Examples</a></li>
</ul>
</li>
<li><a href="#org2d3f59e">5.5. Example: an implementation of <code>fopen()</code> and <code>getc()</code></a>
<ul>
<li><a href="#orgbd5a50f">5.5.1. <code>FILE</code> type build-up and Macros</a>
<ul>
<li><a href="#orgd44a713">5.5.1.1. Setting flags</a></li>
<li><a href="#org2b2b3ea">5.5.1.2. Macro <code>getc()</code></a></li>
<li><a href="#org472871c">5.5.1.3. Macro <code>putc()</code></a></li>
</ul>
</li>
<li><a href="#orgf55ba3e">5.5.2. <code>fopen()</code></a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orge39320e">6. Place Holder</a></li>
</ul>
</div>
</div>

<div id="outline-container-org7053e66" class="outline-2">
<h2 id="org7053e66"><span class="section-number-2">1</span> Generals</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgeb5e6cd" class="outline-3">
<h3 id="orgeb5e6cd"><span class="section-number-3">1.1</span> Some Facts</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Below are some general facts about C language.
</p>
<ul class="org-ul">
<li>assignments associate from right to left.</li>
<li>arithemetic operators associate left to right</li>
<li>relational operators have lower precedence than arithmetic operators</li>
<li>expressions connected by <code>&amp;&amp;</code> or <code>||</code> are evaluated left to right. <code>&amp;&amp;</code> has a higher precedence than <code>||</code>, both are lower than relational and equality operators. (higher than assignment operators?)</li>
<li>printable characters are always positive</li>
<li>The standard headers <code>&lt;limits.h&gt;</code> and <code>&lt;float.h&gt;</code> contain symbolic constants for all of the sizes of basic data types, along with other properties of the machine and compiler.</li>
<li>a leading 0 (zero) on an integer constant means octal</li>
<li>a leading <code>0x</code> or <code>0X</code> (zero x) means hexadecimal.</li>
<li>you can use escape sequence to represent number. Check it at p51. The complete set of escape sequences are in p52.</li>
<li><code>strlen()</code> function and other string functions are declared in the standard header <code>&lt;string.h&gt;</code>.</li>
<li>external and static variables are initialized to zero by default.</li>
<li>for portability, specify <code>signed</code> or <code>unsigned</code> if non-character data is to be stored in <code>char</code> variables. (p58)</li>
<li><p>
to perform a type conversion:
</p>
<div class="org-src-container">
<pre class="src src-c">double a = 2.5;
printf("%d", (int) a);  
</pre>
</div>
<p>
result will be <code>2</code>.
</p></li>
<li>unary operator associate right to left (like <code>*</code>, <code>++</code>, <code>--</code>)</li>
<li>strcpy() function in C needs a pointer to a character array! A pointer to character will cause segmentation fault</li>
</ul>

<p>
Place holder.
</p>
</div>
</div>

<div id="outline-container-org5d85de7" class="outline-3">
<h3 id="org5d85de7"><span class="section-number-3">1.2</span> headers</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li><code>&lt;stdio.h&gt;</code>: contains input/output functions</li>
<li><code>&lt;ctype.h&gt;</code>: some functions regarding to characters</li>
</ul>
</div>
</div>

<div id="outline-container-orga5ece1e" class="outline-3">
<h3 id="orga5ece1e"><span class="section-number-3">1.3</span> <code>printf()</code> formatting</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Check p26-p27 of the textbook.
</p>

<p>
Use <code>%</code> with symbols to print the variables in different format.
Example:
</p>
<div class="org-src-container">
<pre class="src src-c">printf("%c", a)  //print a in format of character
printf("%s", a)  //print a in format of character string
printf("%nc", a)  //print a in format of character, using a character width of size n (at least)
printf("%f", a)  //print a in format of float
printf("%nf", a)  //print a in format of float, using a width of size n
printf("%n.0f", a)  //print a in format of float, using a character width of size n, with no decimal point and no fraction digits
printf("%n.mf", a)  //print a in format of float, using a character width of size n, with decimal point and m fraction digits
printf("%0.mf", a)  //print a in format of float, with decimal point and m fraction digits. The width is not constrained.
printf("%d", a)  //print a in format of integer
printf("%o", a)  //print a in format of octal integer
printf("%x", a)  //print a in format of hexadecimal integer
</pre>
</div>
</div>
</div>
<div id="outline-container-org4caff2e" class="outline-3">
<h3 id="org4caff2e"><span class="section-number-3">1.4</span> Character Input and Output</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li><code>getchar()</code>: it reads the next input character from a text stream and returns that (from the buffer?).</li>
<li><code>putchar()</code>: it prints a character each time it is called and passed a char into.</li>
</ul>

<p>
Pay attention that a character written between single quotes represents an integer value equal to the numerical value of the character in the machine's character set. This is called a character constant. For example, <code>'a'</code> is actually <code>97</code>.
</p>
</div>
</div>
