Computer Science/C Notes/C_notes.org
** Arrays
The syntax is similar with C++. For example, to define an array of integers with a size of 100, you do:
#+begin_src c
int nums[100];
#+end_src
Remember to initialize each slot:
#+begin_src c
for (int i = 0; i < 100; i++)
  nums[i] = 0;
#+end_src

You can also to use assignment operator and ~{ }~ to initialize the array when defining. For example, the following C-string is initialized when being defined:
#+begin_src c
int main() {
  char s[] = {'a', 'b', 'c' };
  printf("%s", s);
  return 0;
}
#+end_src
** Enumeration constant
An enumeration is a list of constant integer values. For example:
#+begin_src c
enum boolean { NO, YES };
#+end_src
The first name in an ~enum~ has value 0, the next 1, and so on, unless explicit values are specified:
#+begin_src c
enum boolean { YES = 1, NO = 0 };
#+end_src

If not all values are specified, unspecified values continue the progression from the last specified value:
#+begin_src c
enum months { JAN = 1, FEB, MAR, APR, MAY, JUN, JUL, AUG, SEP, OCT, NOV, DEC };
// FEB is 2, MAR is 3, etc.
#+end_src

Names in different enumerations must be distinct. Values need not be distinct in the same enumeration. Enumeration works like using ~#define~ to associate constant values with names:
#+begin_src c
#define JAN 1
#define FEB 2
// etc
#+end_src
** type-cast an expression
Explicit type conversions can be forced ("coerced") in any expression. For example:
#+begin_src c
int main() {
  int n = 2;
  printf("%f", (float) n);
  return 0;
}
#+end_src
In the above example, when being printed, the type of ~n~ has been modified to ~float~. Notice that ~n~ itself is not altered. This is called a /cast/, it is an unary operator, has the same high precedence as other unary operators.
** Bitwise operators
p62

There are 6 bitwise operators for bit manipulation. They may be applied to integral operands only.

They are:
- ~&~  : bitwise AND
- ~|~  : bitwise inclusive OR
- ~^~  : bitwise exclusive OR
- ~<<~ : left shift
- ~>>~ : right shift
- =~=  : one's complement (unary)

The precedence of the bitwise operators ~&~, ~^~ and ~|~ is lower than ~==~ and ~!=~.
** Operators can be used with assignment operators
p64

~+, -, *, /, %, <<, >>, &, ^, |~
** Symbolic Constants
A ~#define~ line defines a symbolic name or symbolic constants to be a particular string of characters. You use it like: ~#define~ /name/ /replacement text/. You put this at the head of your code (outside scope of any function to make it globally). Example:
#+begin_src c
#include <stdio.h>

#define LOWER 0
#define UPPER 300
#define STEP 20

int main() {
  
  for (int i = LOWER; i <= UPPER; i += STEP) {
    printf("%5d\t%20f", i, 5 * (i - 32) / 9.0);
    printf("\n");
  }
  
  return 0;
}
#+end_src
Pay attention that symbolic name or symbolic constants are not variables. They are conventionally written in upper case. No semicolon at the end of a ~#define~ line.
* Functions and Program Structure
** External Variables
If an external variables is to be referred to before it is defined, or if it is defined in a different source file from the one where it is being used, then an ~extern~ declaration is mandatory. For example, a function using external variables in a different source file can declare these variables in following manner:
#+begin_src c
int addNum(int a) {
  extern int ADDAMOUNT;  // variable ADDAMOUNT is in different source file

  return a + ADDAMOUNT;
}
#+end_src
Array sizes must be specified with the definition, but are optional with an ~extern~ declaration.
** The C Preprocessor
*** File Inclusion
*** Macro Substitution
**** General
A definition of a macro Substitution has the form:
#+begin_src c
#define name replacement_text
#+end_src
After this line, subsequent occurrences of the token ~name~ will be replaced by the ~replacement_text~. ~name~ has the same form as a variable name (so no white space is allowed between characters), ~replacement_text~ is arbiturary.

~replacement_text~ is the rest of the line. If you need long definition, you can place a ~'\'~ at the end of each line to be continued. For example:
#+begin_src c
#include <stdio.h>
#define say_hi_5_times  (for (int i = 0; i < 5; i++) \
                          printf("Hi\n");)

int main() {
  say_hi_5_times
  return 0;
}
#+end_src
This program will print ~"Hi"~ 5 times. Notice that there is no ~;~ after the macro, this is because ~say_hi_5_times~ calls for a macro substitution, every occurrence of ~say_hi_5_times~ will be replaced by:
#+begin_src c
for (int i = 0; i < 5; i++)
  printf("Hi\n");
#+end_src
Thus, after preprocessing, the code is actually:
#+begin_src c
#include <stdio.h>

int main() {
  for (int i = 0; i < 5; i++)
    printf("Hi\n");
  for (int i = 0; i < 5; i++)
    printf("Hi\n");
  for (int i = 0; i < 5; i++)
    printf("Hi\n");
  for (int i = 0; i < 5; i++)
    printf("Hi\n");
  for (int i = 0; i < 5; i++)
    printf("Hi\n");
    
  return 0;
}
#+end_src
Notice: you can use ~'\'~ inside the parenthese.

**** Arguments
It is possible to define macros with arguments, so the replacement text can be different for different calls of the macro. For example:
#+begin_src c
#define max(A, B) ((A) > (B) ? (A) : (B))
#+end_src
Do not treat it as function call, there is nothing relating to function happening here. It is still a macro substitution. Each occurrence of a formal parameter (here ~A~ or ~B~) will be replaced by the corresponding actual argument. For example, if ~max(p+q, r+s)~ appeared, after preprocessing, this line will become:
#+begin_src c
((p+q) > (r+s) ? (p+q) : (r+s))
#+end_src

You can even put function names in the parameter:
#+begin_src c
#include <stdio.h>
#define plus(A, B) (A)() + (B)()

int one() {
  return 1;
}

int two() {
  return 2;
}

int main() {
  printf("result: %d", plus(one, two));
  return 0;
}
#+end_src
The output is: ~result: 3~
