Computer Science/C Notes/C_notes.html
<div id="outline-container-org778e16a" class="outline-3">
<h3 id="org778e16a"><span class="section-number-3">1.5</span> Arrays</h3>
<div class="outline-text-3" id="text-1-5">
<p>
The syntax is similar with C++. For example, to define an array of integers with a size of 100, you do:
</p>
<div class="org-src-container">
<pre class="src src-c">int nums[100];
</pre>
</div>
<p>
Remember to initialize each slot:
</p>
<div class="org-src-container">
<pre class="src src-c">for (int i = 0; i &lt; 100; i++)
  nums[i] = 0;
</pre>
</div>

<p>
You can also to use assignment operator and <code>{ }</code> to initialize the array when defining. For example, the following C-string is initialized when being defined:
</p>
<div class="org-src-container">
<pre class="src src-c">int main() {
  char s[] = {'a', 'b', 'c' };
  printf("%s", s);
  return 0;
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org9d7d979" class="outline-3">
<h3 id="org9d7d979"><span class="section-number-3">1.6</span> Enumeration constant</h3>
<div class="outline-text-3" id="text-1-6">
<p>
An enumeration is a list of constant integer values. For example:
</p>
<div class="org-src-container">
<pre class="src src-c">enum boolean { NO, YES };
</pre>
</div>
<p>
The first name in an <code>enum</code> has value 0, the next 1, and so on, unless explicit values are specified:
</p>
<div class="org-src-container">
<pre class="src src-c">enum boolean { YES = 1, NO = 0 };
</pre>
</div>

<p>
If not all values are specified, unspecified values continue the progression from the last specified value:
</p>
<div class="org-src-container">
<pre class="src src-c">enum months { JAN = 1, FEB, MAR, APR, MAY, JUN, JUL, AUG, SEP, OCT, NOV, DEC };
// FEB is 2, MAR is 3, etc.
</pre>
</div>

<p>
Names in different enumerations must be distinct. Values need not be distinct in the same enumeration. Enumeration works like using <code>#define</code> to associate constant values with names:
</p>
<div class="org-src-container">
<pre class="src src-c">#define JAN 1
#define FEB 2
// etc
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb1e31e9" class="outline-3">
<h3 id="orgb1e31e9"><span class="section-number-3">1.7</span> type-cast an expression</h3>
<div class="outline-text-3" id="text-1-7">
<p>
Explicit type conversions can be forced ("coerced") in any expression. For example:
</p>
<div class="org-src-container">
<pre class="src src-c">int main() {
  int n = 2;
  printf("%f", (float) n);
  return 0;
}
</pre>
</div>
<p>
In the above example, when being printed, the type of <code>n</code> has been modified to <code>float</code>. Notice that <code>n</code> itself is not altered. This is called a <i>cast</i>, it is an unary operator, has the same high precedence as other unary operators.
</p>
</div>
</div>
<div id="outline-container-orge1f128f" class="outline-3">
<h3 id="orge1f128f"><span class="section-number-3">1.8</span> Bitwise operators</h3>
<div class="outline-text-3" id="text-1-8">
<p>
p62
</p>

<p>
There are 6 bitwise operators for bit manipulation. They may be applied to integral operands only.
</p>

<p>
They are:
</p>
<ul class="org-ul">
<li><code>&amp;</code>  : bitwise AND</li>
<li><code>|</code>  : bitwise inclusive OR</li>
<li><code>^</code>  : bitwise exclusive OR</li>
<li><code>&lt;&lt;</code> : left shift</li>
<li><code>&gt;&gt;</code> : right shift</li>
<li><code>~</code>  : one's complement (unary)</li>
</ul>

<p>
The precedence of the bitwise operators <code>&amp;</code>, <code>^</code> and <code>|</code> is lower than <code>==</code> and <code>!=</code>.
</p>
</div>
</div>
<div id="outline-container-org250705c" class="outline-3">
<h3 id="org250705c"><span class="section-number-3">1.9</span> Operators can be used with assignment operators</h3>
<div class="outline-text-3" id="text-1-9">
<p>
p64
</p>

<p>
<code>+, -, *, /, %, &lt;&lt;, &gt;&gt;, &amp;, ^, |</code>
</p>
</div>
</div>
<div id="outline-container-orgd370d06" class="outline-3">
<h3 id="orgd370d06"><span class="section-number-3">1.10</span> Symbolic Constants</h3>
<div class="outline-text-3" id="text-1-10">
<p>
A <code>#define</code> line defines a symbolic name or symbolic constants to be a particular string of characters. You use it like: <code>#define</code> <i>name</i> <i>replacement text</i>. You put this at the head of your code (outside scope of any function to make it globally). Example:
</p>
<div class="org-src-container">
<pre class="src src-c">#include &lt;stdio.h&gt;

#define LOWER 0
#define UPPER 300
#define STEP 20

int main() {

  for (int i = LOWER; i &lt;= UPPER; i += STEP) {
    printf("%5d\t%20f", i, 5 * (i - 32) / 9.0);
    printf("\n");
  }

  return 0;
}
</pre>
</div>
<p>
Pay attention that symbolic name or symbolic constants are not variables. They are conventionally written in upper case. No semicolon at the end of a <code>#define</code> line.
</p>
</div>
</div>
</div>
<div id="outline-container-orge4a342d" class="outline-2">
<h2 id="orge4a342d"><span class="section-number-2">2</span> Functions and Program Structure</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org03e259d" class="outline-3">
<h3 id="org03e259d"><span class="section-number-3">2.1</span> External Variables</h3>
<div class="outline-text-3" id="text-2-1">
<p>
If an external variables is to be referred to before it is defined, or if it is defined in a different source file from the one where it is being used, then an <code>extern</code> declaration is mandatory. For example, a function using external variables in a different source file can declare these variables in following manner:
</p>
<div class="org-src-container">
<pre class="src src-c">int addNum(int a) {
  extern int ADDAMOUNT;  // variable ADDAMOUNT is in different source file

  return a + ADDAMOUNT;
}
</pre>
</div>
<p>
Array sizes must be specified with the definition, but are optional with an <code>extern</code> declaration.
</p>
</div>
</div>
<div id="outline-container-orgff39cf2" class="outline-3">
<h3 id="orgff39cf2"><span class="section-number-3">2.2</span> The C Preprocessor</h3>
<div class="outline-text-3" id="text-2-2">
</div>
<div id="outline-container-org42ff3dc" class="outline-4">
<h4 id="org42ff3dc"><span class="section-number-4">2.2.1</span> File Inclusion</h4>
</div>
<div id="outline-container-org6800269" class="outline-4">
<h4 id="org6800269"><span class="section-number-4">2.2.2</span> Macro Substitution</h4>
<div class="outline-text-4" id="text-2-2-2">
</div>
<div id="outline-container-orgb8310ed" class="outline-5">
<h5 id="orgb8310ed"><span class="section-number-5">2.2.2.1</span> General</h5>
<div class="outline-text-5" id="text-2-2-2-1">
<p>
A definition of a macro Substitution has the form:
</p>
<div class="org-src-container">
<pre class="src src-c">#define name replacement_text
</pre>
</div>
<p>
After this line, subsequent occurrences of the token <code>name</code> will be replaced by the <code>replacement_text</code>. <code>name</code> has the same form as a variable name (so no white space is allowed between characters), <code>replacement_text</code> is arbiturary.
</p>

<p>
<code>replacement_text</code> is the rest of the line. If you need long definition, you can place a <code>'\'</code> at the end of each line to be continued. For example:
</p>
<div class="org-src-container">
<pre class="src src-c">#include &lt;stdio.h&gt;
#define say_hi_5_times  (for (int i = 0; i &lt; 5; i++) \
			  printf("Hi\n");)

int main() {
  say_hi_5_times
  return 0;
}
</pre>
</div>
<p>
This program will print <code>"Hi"</code> 5 times. Notice that there is no <code>;</code> after the macro, this is because <code>say_hi_5_times</code> calls for a macro substitution, every occurrence of <code>say_hi_5_times</code> will be replaced by:
</p>
<div class="org-src-container">
<pre class="src src-c">for (int i = 0; i &lt; 5; i++)
  printf("Hi\n");
</pre>
</div>
<p>
Thus, after preprocessing, the code is actually:
</p>
<div class="org-src-container">
<pre class="src src-c">#include &lt;stdio.h&gt;

int main() {
  for (int i = 0; i &lt; 5; i++)
    printf("Hi\n");
  for (int i = 0; i &lt; 5; i++)
    printf("Hi\n");
  for (int i = 0; i &lt; 5; i++)
    printf("Hi\n");
  for (int i = 0; i &lt; 5; i++)
    printf("Hi\n");
  for (int i = 0; i &lt; 5; i++)
    printf("Hi\n");

  return 0;
}
</pre>
</div>
<p>
Notice: you can use <code>'\'</code> inside the parenthese.
</p>
</div>
</div>

<div id="outline-container-orgde403df" class="outline-5">
<h5 id="orgde403df"><span class="section-number-5">2.2.2.2</span> Arguments</h5>
<div class="outline-text-5" id="text-2-2-2-2">
<p>
It is possible to define macros with arguments, so the replacement text can be different for different calls of the macro. For example:
</p>
<div class="org-src-container">
<pre class="src src-c">#define max(A, B) ((A) &gt; (B) ? (A) : (B))
</pre>
</div>
<p>
Do not treat it as function call, there is nothing relating to function happening here. It is still a macro substitution. Each occurrence of a formal parameter (here <code>A</code> or <code>B</code>) will be replaced by the corresponding actual argument. For example, if <code>max(p+q, r+s)</code> appeared, after preprocessing, this line will become:
</p>
<div class="org-src-container">
<pre class="src src-c">((p+q) &gt; (r+s) ? (p+q) : (r+s))
</pre>
</div>

<p>
You can even put function names in the parameter:
</p>
<div class="org-src-container">
<pre class="src src-c">#include &lt;stdio.h&gt;
#define plus(A, B) (A)() + (B)()

int one() {
  return 1;
}

int two() {
  return 2;
}

int main() {
  printf("result: %d", plus(one, two));
  return 0;
}
</pre>
</div>
<p>
The output is: <code>result: 3</code>
</p>
</div>
</div>
