Computer Science/C Notes/C_notes.org
**** Pitfalls
There are pitfalls hidden in the macro substitution. For example, in the ~max()~ macro:
#+begin_src c
#define max(A, B) ((A) > (B) ? (A) : (B))
#+end_src
each expression is evaluated twice. Thus usages like ~max(i++, j++)~ will increment the larger value twice (first in the comparing part, next in the "returning" part). User of ~max(i++, j++)~ may expect single increment.

An other example of pitfall is
#+begin_src c
#define square(x) x * x
#+end_src
Notice there is no parenthese, so if we have an expression like ~square(a + 1)~, after macro substitution, the actual expression is:
#+begin_src c
a + 1 * a + 1
#+end_src
which is not ~(a + 1) * (a + 1)~. So, make sure to use parenthese to enclose your parameters to avoid such mistake. In the above example, ~square(x)~ should be:
#+begin_src c
#define square(x) ((x) * (x))
#+end_src

*** Conditional Inclusion
* Pointers and Arrays
** Command-line Arguments
p128 in CPL.

We can pass command-line arguments or parameters to a program when it begins executing. An example is the echo program. On the command prompt, you enter ~ehco~, followed by a series of arguments:
#+BEGIN_EXAMPLE
$ echo hello world
#+END_EXAMPLE
then press enter. The command line window will repeat the inputed arguments:
#+BEGIN_EXAMPLE
$ echo hello world
$ hello world
#+END_EXAMPLE
The two strings ~"hello"~ and ~"world"~ are two arguments passed in echo program.

Basically, when ~main()~ is called, it is called with two arguments: ~argc~ and ~argv~.
- ~argc~: stands for argument count. It is the number of command-line arguments when the program was invoked (i.e. how many strings are there in the line that invoked the program). In the above echo example, ~argc == 3~, the three strings are: "echo", "hello" and "world", respectively.
- ~argv~: stands for argument vector. It is a pointer to an array of character strings that contain the actual arguments, one per string. You can imagine when you type in command line to invoke a program, what you typed in was stored somewhere in an array of character strings. Additionally, the standard requires that ~argv[argc]~ be a null pointer. In the echo example, you typed "echo hello world", and following array of characters was stored:
  #+BEGIN_EXAMPLE
  ["echo", "hello", "world", 0]
  #+END_EXAMPLE

*** Example: ~echo~
Knowing this, we can write a program that mimic the ~echo~ function: re-print what we typed in when we invoke the program to terminal:
#+begin_src c
#include <stdio.h>

int main(int argc, char* argv[]) {
  while (*(++argv))
    printf("%s%s", *argv, *(argv + 1) ? " " : "");  // the second %s is for the space
  
  printf("\n");
  
  return 0;
}
#+end_src

*** Example: ~pattern_finding~
This program will try to find any lines in the input buffer that contains the keyword passed in when invoking it. For example, in command line prompt:
#+BEGIN_EXAMPLE
$ pattern_finding love < text.txt
#+END_EXAMPLE
it will print all lines that contain ~love~ to the terminal.

The program uses ~strstr()~ to search the existence of a certain keyword in target string. We also write a ~getline()~ function to get one single line from input buffer (using ~getchar()~). Pay attention that in the new C library (~stdio.h~), a ~getline()~ function has been added. So we rename our function to ~getlines()~. The code is as follows:
#+begin_src c
#include <stdio.h>
#include <string.h>
#define MAXLINE 1000

int getlines(char* line, int max);

//find: print lines that match pattern from 1st arg 
int main(int argc, char* argv[]) {
  char line[MAXLINE];  // used to hold a line of string
  int found = 0;
  
  if (argc != 2)
    printf("Usage: find pattern\n");
  else
    while (getlines(line, MAXLINE) > 0)
      if (strstr(line, argv[1]) != NULL) {
        printf("No.%d: %s", ++found, line);
      }
  
  return found;
}

int getlines(char* line, int max) {
  char ch;
  
  while (--max > 0 && (ch = getchar()) != EOF && ch != '\n') {
    *(line++) = ch;
  }
  
  if (ch == '\n')
    *(line++) = ch;  // no need to worry about not enough space, since if ch == '\n', it is not stored in line yet, because the loop was not executed
  *line = '\0';
  
  if (ch == EOF)
    return -1;
  
  return 1;
}
#+end_src

