Computer Science/C Notes/C_notes.html
<div id="outline-container-orgdbb2f0c" class="outline-5">
<h5 id="orgdbb2f0c"><span class="section-number-5">2.2.2.3</span> Pitfalls</h5>
<div class="outline-text-5" id="text-2-2-2-3">
<p>
There are pitfalls hidden in the macro substitution. For example, in the <code>max()</code> macro:
</p>
<div class="org-src-container">
<pre class="src src-c">#define max(A, B) ((A) &gt; (B) ? (A) : (B))
</pre>
</div>
<p>
each expression is evaluated twice. Thus usages like <code>max(i++, j++)</code> will increment the larger value twice (first in the comparing part, next in the "returning" part). User of <code>max(i++, j++)</code> may expect single increment.
</p>

<p>
An other example of pitfall is
</p>
<div class="org-src-container">
<pre class="src src-c">#define square(x) x * x
</pre>
</div>
<p>
Notice there is no parenthese, so if we have an expression like <code>square(a + 1)</code>, after macro substitution, the actual expression is:
</p>
<div class="org-src-container">
<pre class="src src-c">a + 1 * a + 1
</pre>
</div>
<p>
which is not <code>(a + 1) * (a + 1)</code>. So, make sure to use parenthese to enclose your parameters to avoid such mistake. In the above example, <code>square(x)</code> should be:
</p>
<div class="org-src-container">
<pre class="src src-c">#define square(x) ((x) * (x))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org68a42dd" class="outline-4">
<h4 id="org68a42dd"><span class="section-number-4">2.2.3</span> Conditional Inclusion</h4>
</div>
</div>
</div>
<div id="outline-container-org5814482" class="outline-2">
<h2 id="org5814482"><span class="section-number-2">3</span> Pointers and Arrays</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgf44a5f8" class="outline-3">
<h3 id="orgf44a5f8"><span class="section-number-3">3.1</span> Command-line Arguments</h3>
<div class="outline-text-3" id="text-3-1">
<p>
p128 in CPL.
</p>

<p>
We can pass command-line arguments or parameters to a program when it begins executing. An example is the echo program. On the command prompt, you enter <code>ehco</code>, followed by a series of arguments:
</p>
<pre class="example">
$ echo hello world
</pre>
<p>
then press enter. The command line window will repeat the inputed arguments:
</p>
<pre class="example">
$ echo hello world
$ hello world
</pre>
<p>
The two strings <code>"hello"</code> and <code>"world"</code> are two arguments passed in echo program.
</p>

<p>
Basically, when <code>main()</code> is called, it is called with two arguments: <code>argc</code> and <code>argv</code>.
</p>
<ul class="org-ul">
<li><code>argc</code>: stands for argument count. It is the number of command-line arguments when the program was invoked (i.e. how many strings are there in the line that invoked the program). In the above echo example, <code>argc == 3</code>, the three strings are: "echo", "hello" and "world", respectively.</li>
<li><p>
<code>argv</code>: stands for argument vector. It is a pointer to an array of character strings that contain the actual arguments, one per string. You can imagine when you type in command line to invoke a program, what you typed in was stored somewhere in an array of character strings. Additionally, the standard requires that <code>argv[argc]</code> be a null pointer. In the echo example, you typed "echo hello world", and following array of characters was stored:
</p>
<pre class="example">
["echo", "hello", "world", 0]
</pre></li>
</ul>
</div>

<div id="outline-container-org9dd88e2" class="outline-4">
<h4 id="org9dd88e2"><span class="section-number-4">3.1.1</span> Example: <code>echo</code></h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
Knowing this, we can write a program that mimic the <code>echo</code> function: re-print what we typed in when we invoke the program to terminal:
</p>
<div class="org-src-container">
<pre class="src src-c">#include &lt;stdio.h&gt;

int main(int argc, char* argv[]) {
  while (*(++argv))
    printf("%s%s", *argv, *(argv + 1) ? " " : "");  // the second %s is for the space

  printf("\n");

  return 0;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org883176b" class="outline-4">
<h4 id="org883176b"><span class="section-number-4">3.1.2</span> Example: <code>pattern_finding</code></h4>
<div class="outline-text-4" id="text-3-1-2">
<p>
This program will try to find any lines in the input buffer that contains the keyword passed in when invoking it. For example, in command line prompt:
</p>
<pre class="example">
$ pattern_finding love &lt; text.txt
</pre>
<p>
it will print all lines that contain <code>love</code> to the terminal.
</p>

<p>
The program uses <code>strstr()</code> to search the existence of a certain keyword in target string. We also write a <code>getline()</code> function to get one single line from input buffer (using <code>getchar()</code>). Pay attention that in the new C library (<code>stdio.h</code>), a <code>getline()</code> function has been added. So we rename our function to <code>getlines()</code>. The code is as follows:
</p>
<div class="org-src-container">
<pre class="src src-c">#include &lt;stdio.h&gt;
#include &lt;string.h&gt;
#define MAXLINE 1000

int getlines(char* line, int max);

//find: print lines that match pattern from 1st arg 
int main(int argc, char* argv[]) {
  char line[MAXLINE];  // used to hold a line of string
  int found = 0;

  if (argc != 2)
    printf("Usage: find pattern\n");
  else
    while (getlines(line, MAXLINE) &gt; 0)
      if (strstr(line, argv[1]) != NULL) {
	printf("No.%d: %s", ++found, line);
      }

  return found;
}

int getlines(char* line, int max) {
  char ch;

  while (--max &gt; 0 &amp;&amp; (ch = getchar()) != EOF &amp;&amp; ch != '\n') {
    *(line++) = ch;
  }

  if (ch == '\n')
    *(line++) = ch;  // no need to worry about not enough space, since if ch == '\n', it is not stored in line yet, because the loop was not executed
  *line = '\0';

  if (ch == EOF)
    return -1;

  return 1;
}
</pre>
</div>
</div>
</div>
