Computer Science/C Notes/C_notes.org
*** Optional arguments example: ~pattern_finding~ extended
Now we extend our ~pattern_finding~ program so it can accept optional arguments. A convention for C programs on UNIX systems is that an argument that begins with a minus sign introduces an optical flag or parameter. Optional arguments should be permitted in any order, they can also be combined (a minus sign with two or more optional arguments, without space between each other).

There is no magic about optional arguments. They are collected as strings in ~argv[]~ when the program is invoked, just like anyother strings occured when invoking the function. We extend the ~pattern_finding~ program to include support for two optional arguments:
1. -x: print lines that doesn't contain the target pattern;
2. -n: in addition to print lines, the program will also print the corresponding line number before the line.
So, the program can be invoked in following way:
#+BEGIN_EXAMPLE
$ pattern_finding -n -x keyword < text.txt
#+END_EXAMPLE
in this case, when ~main()~ is called, ~argc == 4~, ~*argv == {"pattern_finding", "-n", "-x", "keyword"}~. ~< text.txt~ is just redirect ~stdin~ to the text.

Or, we can combine the two optional arguments:
#+BEGIN_EXAMPLE
$ pattern_finding -xn keyword < text.txt
#+END_EXAMPLE
in this case, when ~main()~ is called, ~argc == 3~, ~*argv == {"pattern_finding", "-xn", "keyword"}~.

Thus, we have to write code to analyze argument strings that has ~"-xxx"~ form. Generally, we keep a list of flags inside the program. If we encountered any optional argument in the string, we can set the corresponding flag to true.

The code and explanation is as follows:
#+begin_src c
#include <stdio.h>
#include <string.h>
#define MAXLINE 1000

int getlines(char* line, int max);

//find: print lines that match pattern from 1st arg 
// with optional arguments enabled
int main(int argc, char* argv[]) {
  char line[MAXLINE];  // temporary container to hold line read from buffer
  char c;  // to check optional arguments 
  
  int line_num = 0;  // record the number of line                                                             
  int except = 0;  // flag of optional argument x, if this is true, print lines that doesn't have pattern  
  int number = 0;  // flag for optional argument n , if this is true, print the corresponding line number
  int found = 0;
  
  
  // check inputted arguments and set flag accordingly
  // use prefix to skip the first argv (which is the name of the function)
  while (--argc > 0 && (*++argv)[0] == '-')  // outter while loop check each "-xxx" styled optional argument 
    while (c = *++argv[0]) {  // inner while loop check each char in the "-xxx" styled argument
      switch (c) {
      case 'x':
        except = 1;
        break;
      case 'n':
        number = 1;
        break;
      default:
        printf("find: illegal option %c\n", c);
        argc = 0;  // this will terminate the program
        found = -1;
        break;
      }
    }
    
  if (argc != 1)  //we should have only one argument at this point, which is the pattern we are going to find. All optional arguments have been examed by the previous while loop 
    printf("Usage: find -x -n pattern\n");  // print a message showing how to use this program
  else
    while (getlines(line, MAXLINE) > 0) {
      line_num++;  // update the line number
      
      /*Notes: 
        Print the line based on value of variable except and the found result.
        To print a line, the truth value of found and except should be different. When except = 1, we print lines that not found, so found == 0;
        When except = 0, we print lines that are found, so found == 1;
      */
      if ((strstr(line, *argv) != NULL) != except) {
        if (number)  // if the number flag is true, we print the line number 
          printf("%d", line_num);
        printf("%s", line);
        found++;
      }
      
    }
    
  return found;
    
}

int getlines(char* line, int max) {
  char ch;
  
  while (--max > 0 && (ch = getchar()) != EOF && ch != '\n') {
    *(line++) = ch;
  }
  
  if (ch == '\n')
    *(line++) = ch;  // no need to worry about not enough space, since if ch == '\n', it is not stored in line yet, because the loop was not executed
  *line = '\0';
  
  if (ch == EOF)
    return -1;
  
  return 1;
}
#+end_src

** Pointers to Functions
It is possible to define pointers to functions, which can be assigned, placed in arrays, passed to functions, returned by functions, and so on.

To declare a pointer to a function, you write:
#+BEGIN_EXAMPLE
return_type (*ptr_name)(parameter1_type, parameter2_type, ...)
#+END_EXAMPLE
Explanation:
- ~return_type~: the return type of the function this pointer pointing to.
- ~ptr_name~: the name of the pointer variable
- ~parameter_type~: the type of the function this pointer referring to.

Example:
#+begin_src c
#include <stdio.h>

int add(int a, int b) {
  return a + b;
}

int main() {
  int (*a)(int, int);
  a = &add;
  printf("%d\n", (*a)(2, 3));
}
#+end_src
When calling the function pointer, you have to use parenthese to enclose ~*~ and pointer name. Use ~&~ and function name to get the "address" of the function.

*** Example: qsort() which takes a comp() function pointer
(Example 5-11).

A quick sort function which takes a function pointer to be used in its body to sort is as follows:
#+begin_src c
void qsorts(void* v[], int left, int right, int (*comp)(void*, void*)) {
  int last;
  
  if (left >= right)
    return;
  
  swap(v, left, (left + right) / 2);
  last = left;
  
  for (int i = left + 1; i <= right; i++)
    if ((*comp)(v[i], v[left]) < 0)
      swap(v, i, ++last);
  
  swap(v, left, last);
  qsorts(v, left, last - 1, comp);
  qsorts(v, last + 1, right, comp);
}
#+end_src

* Input and Output

** Standard Input and Output
*** Input redirection
In many environments, a file may be substituted for the keyboard as the source of standard input by using the ~<~ convention for input redirection. For example, we have following code:
#+begin_src c
#include <stdio.h>

int main() {
  char c;
  while ((c = getchar()) != EOF)
    printf("%c", c);

  return 0;
}
#+end_src
When we call the program, we use ~<~ to redirect standard input with a file:
#+BEGIN_EXAMPLE
$ ./a.out < out.txt
#+END_EXAMPLE
the effect of this program is to print all content in ~out.txt~ to standard output.
*** Output redirection
We can also redirect a program's standard output to a file. We use ~>~ convention to do it, the syntax is:
#+BEGIN_EXAMPLE
$./a.out > result.txt
#+END_EXAMPLE
in this way, all standard output of ~a.out~ will be redirected to file ~result.txt~. The file will be created if not exist.

Output produced by ~putchar()~ and ~printf()~ are the same, they will both finds its way to the standard output.
