Computer Science/C Notes/C_notes.html

<div id="outline-container-org3477efa" class="outline-4">
<h4 id="org3477efa"><span class="section-number-4">3.1.3</span> Optional arguments example: <code>pattern_finding</code> extended</h4>
<div class="outline-text-4" id="text-3-1-3">
<p>
Now we extend our <code>pattern_finding</code> program so it can accept optional arguments. A convention for C programs on UNIX systems is that an argument that begins with a minus sign introduces an optical flag or parameter. Optional arguments should be permitted in any order, they can also be combined (a minus sign with two or more optional arguments, without space between each other).
</p>

<p>
There is no magic about optional arguments. They are collected as strings in <code>argv[]</code> when the program is invoked, just like anyother strings occured when invoking the function. We extend the <code>pattern_finding</code> program to include support for two optional arguments:
</p>
<ol class="org-ol">
<li>-x: print lines that doesn't contain the target pattern;</li>
<li>-n: in addition to print lines, the program will also print the corresponding line number before the line.</li>
</ol>
<p>
So, the program can be invoked in following way:
</p>
<pre class="example">
$ pattern_finding -n -x keyword &lt; text.txt
</pre>
<p>
in this case, when <code>main()</code> is called, <code>argc == 4</code>, <code>*argv == {"pattern_finding", "-n", "-x", "keyword"}</code>. <code>&lt; text.txt</code> is just redirect <code>stdin</code> to the text.
</p>

<p>
Or, we can combine the two optional arguments:
</p>
<pre class="example">
$ pattern_finding -xn keyword &lt; text.txt
</pre>
<p>
in this case, when <code>main()</code> is called, <code>argc == 3</code>, <code>*argv == {"pattern_finding", "-xn", "keyword"}</code>.
</p>

<p>
Thus, we have to write code to analyze argument strings that has <code>"-xxx"</code> form. Generally, we keep a list of flags inside the program. If we encountered any optional argument in the string, we can set the corresponding flag to true.
</p>

<p>
The code and explanation is as follows:
</p>
<div class="org-src-container">
<pre class="src src-c">#include &lt;stdio.h&gt;
#include &lt;string.h&gt;
#define MAXLINE 1000

int getlines(char* line, int max);

//find: print lines that match pattern from 1st arg 
// with optional arguments enabled
int main(int argc, char* argv[]) {
  char line[MAXLINE];  // temporary container to hold line read from buffer
  char c;  // to check optional arguments 

  int line_num = 0;  // record the number of line                                                             
  int except = 0;  // flag of optional argument x, if this is true, print lines that doesn't have pattern  
  int number = 0;  // flag for optional argument n , if this is true, print the corresponding line number
  int found = 0;


  // check inputted arguments and set flag accordingly
  // use prefix to skip the first argv (which is the name of the function)
  while (--argc &gt; 0 &amp;&amp; (*++argv)[0] == '-')  // outter while loop check each "-xxx" styled optional argument 
    while (c = *++argv[0]) {  // inner while loop check each char in the "-xxx" styled argument
      switch (c) {
      case 'x':
	except = 1;
	break;
      case 'n':
	number = 1;
	break;
      default:
	printf("find: illegal option %c\n", c);
	argc = 0;  // this will terminate the program
	found = -1;
	break;
      }
    }

  if (argc != 1)  //we should have only one argument at this point, which is the pattern we are going to find. All optional arguments have been examed by the previous while loop 
    printf("Usage: find -x -n pattern\n");  // print a message showing how to use this program
  else
    while (getlines(line, MAXLINE) &gt; 0) {
      line_num++;  // update the line number

      /*Notes: 
	Print the line based on value of variable except and the found result.
	To print a line, the truth value of found and except should be different. When except = 1, we print lines that not found, so found == 0;
	When except = 0, we print lines that are found, so found == 1;
      */
      if ((strstr(line, *argv) != NULL) != except) {
	if (number)  // if the number flag is true, we print the line number 
	  printf("%d", line_num);
	printf("%s", line);
	found++;
      }

    }

  return found;

}

int getlines(char* line, int max) {
  char ch;

  while (--max &gt; 0 &amp;&amp; (ch = getchar()) != EOF &amp;&amp; ch != '\n') {
    *(line++) = ch;
  }

  if (ch == '\n')
    *(line++) = ch;  // no need to worry about not enough space, since if ch == '\n', it is not stored in line yet, because the loop was not executed
  *line = '\0';

  if (ch == EOF)
    return -1;

  return 1;
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org3c67c14" class="outline-3">
<h3 id="org3c67c14"><span class="section-number-3">3.2</span> Pointers to Functions</h3>
<div class="outline-text-3" id="text-3-2">
<p>
It is possible to define pointers to functions, which can be assigned, placed in arrays, passed to functions, returned by functions, and so on.
</p>

<p>
To declare a pointer to a function, you write:
</p>
<pre class="example">
return_type (*ptr_name)(parameter1_type, parameter2_type, ...)
</pre>
<p>
Explanation:
</p>
<ul class="org-ul">
<li><code>return_type</code>: the return type of the function this pointer pointing to.</li>
<li><code>ptr_name</code>: the name of the pointer variable</li>
<li><code>parameter_type</code>: the type of the function this pointer referring to.</li>
</ul>

<p>
Example:
</p>
<div class="org-src-container">
<pre class="src src-c">#include &lt;stdio.h&gt;

int add(int a, int b) {
  return a + b;
}

int main() {
  int (*a)(int, int);
  a = &amp;add;
  printf("%d\n", (*a)(2, 3));
}
</pre>
</div>
<p>
When calling the function pointer, you have to use parenthese to enclose <code>*</code> and pointer name. Use <code>&amp;</code> and function name to get the "address" of the function.
</p>
</div>

<div id="outline-container-org39b4442" class="outline-4">
<h4 id="org39b4442"><span class="section-number-4">3.2.1</span> Example: qsort() which takes a comp() function pointer</h4>
<div class="outline-text-4" id="text-3-2-1">
<p>
(Example 5-11).
</p>

<p>
A quick sort function which takes a function pointer to be used in its body to sort is as follows:
</p>
<div class="org-src-container">
<pre class="src src-c">void qsorts(void* v[], int left, int right, int (*comp)(void*, void*)) {
  int last;

  if (left &gt;= right)
    return;

  swap(v, left, (left + right) / 2);
  last = left;

  for (int i = left + 1; i &lt;= right; i++)
    if ((*comp)(v[i], v[left]) &lt; 0)
      swap(v, i, ++last);

  swap(v, left, last);
  qsorts(v, left, last - 1, comp);
  qsorts(v, last + 1, right, comp);
}
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-org35431ff" class="outline-2">
<h2 id="org35431ff"><span class="section-number-2">4</span> Input and Output</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org97c153e" class="outline-3">
<h3 id="org97c153e"><span class="section-number-3">4.1</span> Standard Input and Output</h3>
<div class="outline-text-3" id="text-4-1">
</div>
<div id="outline-container-org90f3c71" class="outline-4">
<h4 id="org90f3c71"><span class="section-number-4">4.1.1</span> Input redirection</h4>
<div class="outline-text-4" id="text-4-1-1">
<p>
In many environments, a file may be substituted for the keyboard as the source of standard input by using the <code>&lt;</code> convention for input redirection. For example, we have following code:
</p>
<div class="org-src-container">
<pre class="src src-c">#include &lt;stdio.h&gt;

int main() {
  char c;
  while ((c = getchar()) != EOF)
    printf("%c", c);

  return 0;
}
</pre>
</div>
<p>
When we call the program, we use <code>&lt;</code> to redirect standard input with a file:
</p>
<pre class="example">
$ ./a.out &lt; out.txt
</pre>
<p>
the effect of this program is to print all content in <code>out.txt</code> to standard output.
</p>
</div>
</div>
<div id="outline-container-org90b258f" class="outline-4">
<h4 id="org90b258f"><span class="section-number-4">4.1.2</span> Output redirection</h4>
<div class="outline-text-4" id="text-4-1-2">
<p>
We can also redirect a program's standard output to a file. We use <code>&gt;</code> convention to do it, the syntax is:
</p>
<pre class="example">
$./a.out &gt; result.txt
</pre>
<p>
in this way, all standard output of <code>a.out</code> will be redirected to file <code>result.txt</code>. The file will be created if not exist.
</p>

<p>
Output produced by <code>putchar()</code> and <code>printf()</code> are the same, they will both finds its way to the standard output.
</p>
</div>
</div>
