Computer Science/C Notes/C_notes.org
*** Pipe between two programs
It is possible to use one program's standard output as another program's standard input:
#+BEGIN_EXAMPLE
$./prog1 | ./prog2
#+END_EXAMPLE
the above line puts the standard output of ~prog1~ into the standard input of ~prog2~.

*** Include header file
When you include a file with brackets ~<>~, the compiler will search the header in a standard set of places (typically: ~/usr/include~).

*** Macros in standard library
"Functions" like ~getchar~ and ~putchar~ in ~<stdio.h>~, and ~tolower~ in ~<ctype.h>~ are often macros, thus avoiding the overhead of a function call per character.

*** Formatted output: printf
p167 on textbook. A table of ~printf()~'s conversion characters are shown in table 7-1 in the book (p168).

A width or precision may be specified as ~.*~, the value is computed by converting the next argument (which must be an ~int~). For example:
#+begin_src c
int main(int argc, char* argv[]) {
  char* s = "abcdefg";
  int length = 4;
  printf("%.*s\n", length, s);
  return 0;
}
#+end_src
the above program printed the first ~length~ characters in string ~s~. Don't forget the dot before ~*~.

*** Function ~sprintf()~
This function does the same conversions as ~printf()~. It accepts a ~char* string~ argument, and will place the result in ~string~ instead of to the standard output. ~string~ must big enough to receive the result.

** Variable-length Argument Lists
This section will use an implementation of a minimal version of ~printf()~ to show how to write a function that processes a Variable-length argument list in a portable way.

*** Declare a function that takes varying amounts of arguments
To declare a function whose argument number is not fixed (which may vary), we do:
#+begin_src c
void miniPrintf(char* format, ...)
#+end_src
the declaration ~...~ means that the number and types of these arguments may vary. It can only appear at the end of a list of named argument (there must be at least one named argument).

*** Traverse the argument list and final cleanup
The standard header ~<stdarg.h>~ contains a set of macro definitions that define how to step through an argument list. To build functions that takes varying amounts of arguments, you have to include ~<stdarg.h>~.

**** Type ~va_list~
A data type named ~va_list~ is defined in ~<stdarg.h>~. We declare a variable of this type, then use this variable to refer to each unnamed argument passed in the function. It works like a pointer. For example, we can have following declaration:
#+begin_src c
#include <stdarg.h>
void miniPrintf(char* format, ...) {
  va_list ap;  // points to each unnamed argument in turn
  va_start(ap, format);  // make ap point to 1st unnamed argument
  //...
}
#+end_src

**** Macro ~va_start~
After the declaration ~va_list ap;~, ~ap~ is an object of type ~va_list~. How to use it to actually point to the unnamed arguments? We begin by using a macro named ~va_start~. After declaring ~ap~, we call this macro to "initiate" ~ap~:
#+begin_src c
#include <stdarg.h>
void miniPrintf(char* format, ...) {
  va_list ap;  // points to each unnamed argument in turn
  va_start(ap, format);  // make ap point to 1st unnamed argument
  //...
}
#+end_src
~va_start()~ "accepts" two tokens. The first one is the ~va_list~ type variable which will be used to refer to unnamed arguments in turn, here we use ~ap~. The second one should be the *LAST* named argument from the function call. ~va_start~ will use this to locate the beginning of unnamed argument. After this line, ~ap~ will be referring to the first unnamed argument.

But how could we "retrieve" the unnamed argument being referred by ~ap~ and move to next argument? We call ~va_arg~ macro to do this job.

**** Macro ~va_arg~
~va_arg~ is a macro defined in ~<stdarg.h>~. It "accepts" two tokens, the first one is an object of ~va_list~ type (we used ~ap~), the second one is the type name you wish to collect from current argument which ~ap~ is appointing to. When this macro is called, it returns one argument of the type you specified and steps ~ap~ to the next. The type name you provided will be used by ~va_arg~ to determine what type to return and how big a step to take. You have to use another variable of the same type to hold the returned argument, so you can use later.

For example, following call of ~va_arg~ will return an integer argument, and we hold it using an integer variable named ~ival~:
#+begin_src c
int ival;
ival = va_arg(ap, int);
#+end_src

**** Macro ~va_end~
~va_end~ is a macro defined in ~<stdarg.h>~. It takes one token, which is the ~va_list~ object we used in the program. This macro will do whatever needs to cleanup. It must be called before the function returns:
#+begin_src c
va_end(ap);
#+end_src

