Computer Science/C Notes/C_notes.html
<div id="outline-container-org4157cfe" class="outline-4">
<h4 id="org4157cfe"><span class="section-number-4">4.1.3</span> Pipe between two programs</h4>
<div class="outline-text-4" id="text-4-1-3">
<p>
It is possible to use one program's standard output as another program's standard input:
</p>
<pre class="example">
$./prog1 | ./prog2
</pre>
<p>
the above line puts the standard output of <code>prog1</code> into the standard input of <code>prog2</code>.
</p>
</div>
</div>

<div id="outline-container-org14b5f31" class="outline-4">
<h4 id="org14b5f31"><span class="section-number-4">4.1.4</span> Include header file</h4>
<div class="outline-text-4" id="text-4-1-4">
<p>
When you include a file with brackets <code>&lt;&gt;</code>, the compiler will search the header in a standard set of places (typically: <code>/usr/include</code>).
</p>
</div>
</div>

<div id="outline-container-orgbfce7c3" class="outline-4">
<h4 id="orgbfce7c3"><span class="section-number-4">4.1.5</span> Macros in standard library</h4>
<div class="outline-text-4" id="text-4-1-5">
<p>
"Functions" like <code>getchar</code> and <code>putchar</code> in <code>&lt;stdio.h&gt;</code>, and <code>tolower</code> in <code>&lt;ctype.h&gt;</code> are often macros, thus avoiding the overhead of a function call per character.
</p>
</div>
</div>

<div id="outline-container-org6fae4bd" class="outline-4">
<h4 id="org6fae4bd"><span class="section-number-4">4.1.6</span> Formatted output: printf</h4>
<div class="outline-text-4" id="text-4-1-6">
<p>
p167 on textbook. A table of <code>printf()</code>'s conversion characters are shown in table 7-1 in the book (p168).
</p>

<p>
A width or precision may be specified as <code>.*</code>, the value is computed by converting the next argument (which must be an <code>int</code>). For example:
</p>
<div class="org-src-container">
<pre class="src src-c">int main(int argc, char* argv[]) {
  char* s = "abcdefg";
  int length = 4;
  printf("%.*s\n", length, s);
  return 0;
}
</pre>
</div>
<p>
the above program printed the first <code>length</code> characters in string <code>s</code>. Don't forget the dot before <code>*</code>.
</p>
</div>
</div>

<div id="outline-container-org5d3181a" class="outline-4">
<h4 id="org5d3181a"><span class="section-number-4">4.1.7</span> Function <code>sprintf()</code></h4>
<div class="outline-text-4" id="text-4-1-7">
<p>
This function does the same conversions as <code>printf()</code>. It accepts a <code>char* string</code> argument, and will place the result in <code>string</code> instead of to the standard output. <code>string</code> must big enough to receive the result.
</p>
</div>
</div>
</div>

<div id="outline-container-orgeea8fc6" class="outline-3">
<h3 id="orgeea8fc6"><span class="section-number-3">4.2</span> Variable-length Argument Lists</h3>
<div class="outline-text-3" id="text-4-2">
<p>
This section will use an implementation of a minimal version of <code>printf()</code> to show how to write a function that processes a Variable-length argument list in a portable way.
</p>
</div>

<div id="outline-container-orgf1209cb" class="outline-4">
<h4 id="orgf1209cb"><span class="section-number-4">4.2.1</span> Declare a function that takes varying amounts of arguments</h4>
<div class="outline-text-4" id="text-4-2-1">
<p>
To declare a function whose argument number is not fixed (which may vary), we do:
</p>
<div class="org-src-container">
<pre class="src src-c">void miniPrintf(char* format, ...)
</pre>
</div>
<p>
the declaration <code>...</code> means that the number and types of these arguments may vary. It can only appear at the end of a list of named argument (there must be at least one named argument).
</p>
</div>
</div>

<div id="outline-container-orgb44b026" class="outline-4">
<h4 id="orgb44b026"><span class="section-number-4">4.2.2</span> Traverse the argument list and final cleanup</h4>
<div class="outline-text-4" id="text-4-2-2">
<p>
The standard header <code>&lt;stdarg.h&gt;</code> contains a set of macro definitions that define how to step through an argument list. To build functions that takes varying amounts of arguments, you have to include <code>&lt;stdarg.h&gt;</code>.
</p>
</div>

<div id="outline-container-org14f11a4" class="outline-5">
<h5 id="org14f11a4"><span class="section-number-5">4.2.2.1</span> Type <code>va_list</code></h5>
<div class="outline-text-5" id="text-4-2-2-1">
<p>
A data type named <code>va_list</code> is defined in <code>&lt;stdarg.h&gt;</code>. We declare a variable of this type, then use this variable to refer to each unnamed argument passed in the function. It works like a pointer. For example, we can have following declaration:
</p>
<div class="org-src-container">
<pre class="src src-c">#include &lt;stdarg.h&gt;
void miniPrintf(char* format, ...) {
  va_list ap;  // points to each unnamed argument in turn
  va_start(ap, format);  // make ap point to 1st unnamed argument
  //...
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orge9f423d" class="outline-5">
<h5 id="orge9f423d"><span class="section-number-5">4.2.2.2</span> Macro <code>va_start</code></h5>
<div class="outline-text-5" id="text-4-2-2-2">
<p>
After the declaration <code>va_list ap;</code>, <code>ap</code> is an object of type <code>va_list</code>. How to use it to actually point to the unnamed arguments? We begin by using a macro named <code>va_start</code>. After declaring <code>ap</code>, we call this macro to "initiate" <code>ap</code>:
</p>
<div class="org-src-container">
<pre class="src src-c">#include &lt;stdarg.h&gt;
void miniPrintf(char* format, ...) {
  va_list ap;  // points to each unnamed argument in turn
  va_start(ap, format);  // make ap point to 1st unnamed argument
  //...
}
</pre>
</div>
<p>
<code>va_start()</code> "accepts" two tokens. The first one is the <code>va_list</code> type variable which will be used to refer to unnamed arguments in turn, here we use <code>ap</code>. The second one should be the <b>LAST</b> named argument from the function call. <code>va_start</code> will use this to locate the beginning of unnamed argument. After this line, <code>ap</code> will be referring to the first unnamed argument.
</p>

<p>
But how could we "retrieve" the unnamed argument being referred by <code>ap</code> and move to next argument? We call <code>va_arg</code> macro to do this job.
</p>
</div>
</div>

<div id="outline-container-org5b272ca" class="outline-5">
<h5 id="org5b272ca"><span class="section-number-5">4.2.2.3</span> Macro <code>va_arg</code></h5>
<div class="outline-text-5" id="text-4-2-2-3">
<p>
<code>va_arg</code> is a macro defined in <code>&lt;stdarg.h&gt;</code>. It "accepts" two tokens, the first one is an object of <code>va_list</code> type (we used <code>ap</code>), the second one is the type name you wish to collect from current argument which <code>ap</code> is appointing to. When this macro is called, it returns one argument of the type you specified and steps <code>ap</code> to the next. The type name you provided will be used by <code>va_arg</code> to determine what type to return and how big a step to take. You have to use another variable of the same type to hold the returned argument, so you can use later.
</p>

<p>
For example, following call of <code>va_arg</code> will return an integer argument, and we hold it using an integer variable named <code>ival</code>:
</p>
<div class="org-src-container">
<pre class="src src-c">int ival;
ival = va_arg(ap, int);
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf3e02d7" class="outline-5">
<h5 id="orgf3e02d7"><span class="section-number-5">4.2.2.4</span> Macro <code>va_end</code></h5>
<div class="outline-text-5" id="text-4-2-2-4">
<p>
<code>va_end</code> is a macro defined in <code>&lt;stdarg.h&gt;</code>. It takes one token, which is the <code>va_list</code> object we used in the program. This macro will do whatever needs to cleanup. It must be called before the function returns:
</p>
<div class="org-src-container">
<pre class="src src-c">va_end(ap);
</pre>
</div>
</div>
</div>
</div>
