Computer Science/C Notes/C_notes.org
*** Example: ~miniPrintf()~ <<mini_printf>>
In this example, ~miniPrintf()~ takes two arguments, the first one is a pointer to char, which will be the format string or content it will be printing. Every character of ~%~ indicates there is an argument in the argument list waiting to be printed in a certain format. Here, we just use the next character after ~%~ to determine what type of argument we retrieve from the argument list. The function is declared as:
#+begin_src c
#include <stdarg.h>
#include <stdio.h>
void miniPrintf(char* format, ...)
#+end_src
To retrieve arguments in the unamed argument list, we declare an object of type ~va_list~:
#+begin_src c
va_list ap;
char *p;  // to traverse format string
char* sval;  // to hold string argument
int ival;  // to hold integer argument
double dval;  // to hold double argument
#+end_src
Before processing, we need to initialize the ~va_list~ object:
#+begin_src c
va_start(ap, format);
#+end_src
Then, we go over the ~format~ string. If no ~%~ encountered, we call ~putchar()~ to print it directly:
#+begin_src c
for (p = format; *p; p++) {
  if (*p != '%') {
    putchar(*p);
    continue;
  }

  // do things when '%' is found
}
#+end_src
When ~%~ is found, we need to check the next character and determine what data type we need to retrieve from the unamed argument list:
#+begin_src c
for (p = format; *p; p++) {
  if (*p != '%') {
    putchar(*p);
    continue;
  }

  switch (*++p) {  // check next char
  case 'd':
    ival = va_arg(ap, int);
    printf("%d", ival);
    break;
  }
  case 'f':
    dval = va_arg(ap, double);
    printf("%f", dval);
    break;
  case 's':
    for (sval = va_arg(ap, char*); *sval; sval++)
      putchar(*sval);
    break;
  default:
    putchar(*p);
    break;
}
#+end_src
When the style token after ~%~ is ~s~, it means we have to print a string. So the return type of ~va_arg~ is a pointer to ~char~. We print the C-string one character by one character, until we reach the ~'\0'~ terminator.

** Formated Input: ~scanf()~
p171.

*** A simple example
An example of using ~scanf()~:
#+begin_src c
#include <stdio.h>

int main() {
  int a;
  int b;
  int c;
  int d;
  int num;
  scanf("%d%d%d%d", &a, &b, &c, &d);
  printf("a = %d\nb = %d\nc = %d\nd = %d\n", a, b, c, d);

  return 0;
}
#+end_src
here, we read four inputs and store them to four variables. Notice we have to pass in the address of each variable to ~scanf()~. In this way, ~scanf()~ can modify the variable directly (passed by value).

*** Declaration and arguments
~scanf()~ is declared as:
#+begin_src c
int scanf(char *format, ...)
#+end_src

It will use the ~format~ string to retrieve information via certain format, convert them and assign to variables in the followed list. ~scanf()~ stops when it exhausts its format string, or when some input fails to match the control specification. It returns the number of successfully matched and assigned input items (to variable in the unamed argument lists).

The ~format~ string may contain:
1. blanks or tabs. These will be automatically ignored
2. ordinary characters (not ~%~). ~scanf()~ will try to match these characters with the corresponding non-whitespace character of the input stream. For example:
   #+begin_src c
   scanf("%dabcde%d", &a, &b);
   printf("a = %d\nb = %d\n", a, b);
   #+end_src
   input: ~1abcde2~, output:
   #+BEGIN_EXAMPLE
   a = 1
   b = 2
   #+END_EXAMPLE
3. conversion specifications, which is explained below.

A conversion specification is some characters starting with ~%~, which will be used by ~scanf()~ to convert the next *input field* and assign to corresponding variable. An input field is defined as a string of non-white space characters; it extends either to the next white space character or until the field width has been reached (the width of the field may be specified by conversion specification, see below).

In the conversion specification, we may find:
- %: indicating starting of a conversion specification
- *: assignment suppresion marker. If this is present, the input field is skipped, no assignment to variable is made
- number: a number that specifies the maximum width of the input field (of which this current conversion specification is taking care)
- ~h, l or L~: indicating the width of the target. ~%h~: a short integer; ~%l~: a long integer.
- a conversion character: indicating what type to convert to, like ~%d, %c, %s~ etc. (i.e. the interpretation of the input field).

Some examples of using ~scanf()~ can be found on p172, 173.

** File Access<<file_access>>
*** Opening a file
The ~<stdio.h>~ library has a type ~FILE~ and a function ~fopen()~ that provides tools to work on files. The function ~fopen()~'s declaration is as follows:
#+begin_src c
FILE *fopen(char* name, char* mode)
#+end_src
It accepts the name of the file and mode for opening this file. It will return a pointer to a ~FILE~ object. The type ~FILE~ is defined with a ~typedef~, and is a structure that contains information about the file, such as:
- a pointer to a buffer
  - a buffer is used so file can be read in large chunks
- a count of the number of characters left in the buffer
- a pointer to the next character position in the buffer
- the file descriptor
- flags describing:
  - file openning mode: read or write
  - error states: if error has occurred
  - EOF states: whether end of file has occurred

To obtain a pointer to a file, we do:
#+begin_src c
FILE* fp;
fp = fopen(name, mode);
#+end_src
the allowable modes include:
- r: read mode
- w: write mode
- a: append mode
- b: append b to open in binary mode (for some systems)

When errors occurred during file opening, ~fopen()~ will return a ~NULL~.
*** Accessing the file
Once the file is opened, we access it through the ~FILE~ pointer ~fp~. We have following choices:
- ~char getc(FILE *fp)~: (maybe) a macro that accepts a ~FILE~ pointer, returns the next character from the file (character position is recorded inside the ~FILE~ object). It returns ~EOF~ for end of file or error.
- ~char putc(char c, FILE *fp)~: (maybe) a macro that accepts a character ~c~ and a ~FILE~ pointer. It will write ~c~ to the file and returns the character written, or returns ~EOF~ if an error occurs.

After using the file, we have to call ~fclose()~ to disconnect program from the file, freeing the file pointer for another file.

