Computer Science/C Notes/C_notes.html

<div id="outline-container-orgc7c1da3" class="outline-4">
<h4 id="orgc7c1da3"><span class="section-number-4">4.2.3</span> Example: <code>miniPrintf()</code> <a id="org908efcd"></a></h4>
<div class="outline-text-4" id="text-4-2-3">
<p>
In this example, <code>miniPrintf()</code> takes two arguments, the first one is a pointer to char, which will be the format string or content it will be printing. Every character of <code>%</code> indicates there is an argument in the argument list waiting to be printed in a certain format. Here, we just use the next character after <code>%</code> to determine what type of argument we retrieve from the argument list. The function is declared as:
</p>
<div class="org-src-container">
<pre class="src src-c">#include &lt;stdarg.h&gt;
#include &lt;stdio.h&gt;
void miniPrintf(char* format, ...)
</pre>
</div>
<p>
To retrieve arguments in the unamed argument list, we declare an object of type <code>va_list</code>:
</p>
<div class="org-src-container">
<pre class="src src-c">va_list ap;
char *p;  // to traverse format string
char* sval;  // to hold string argument
int ival;  // to hold integer argument
double dval;  // to hold double argument
</pre>
</div>
<p>
Before processing, we need to initialize the <code>va_list</code> object:
</p>
<div class="org-src-container">
<pre class="src src-c">va_start(ap, format);
</pre>
</div>
<p>
Then, we go over the <code>format</code> string. If no <code>%</code> encountered, we call <code>putchar()</code> to print it directly:
</p>
<div class="org-src-container">
<pre class="src src-c">for (p = format; *p; p++) {
  if (*p != '%') {
    putchar(*p);
    continue;
  }

  // do things when '%' is found
}
</pre>
</div>
<p>
When <code>%</code> is found, we need to check the next character and determine what data type we need to retrieve from the unamed argument list:
</p>
<div class="org-src-container">
<pre class="src src-c">for (p = format; *p; p++) {
  if (*p != '%') {
    putchar(*p);
    continue;
  }

  switch (*++p) {  // check next char
  case 'd':
    ival = va_arg(ap, int);
    printf("%d", ival);
    break;
  }
  case 'f':
    dval = va_arg(ap, double);
    printf("%f", dval);
    break;
  case 's':
    for (sval = va_arg(ap, char*); *sval; sval++)
      putchar(*sval);
    break;
  default:
    putchar(*p);
    break;
}
</pre>
</div>
<p>
When the style token after <code>%</code> is <code>s</code>, it means we have to print a string. So the return type of <code>va_arg</code> is a pointer to <code>char</code>. We print the C-string one character by one character, until we reach the <code>'\0'</code> terminator.
</p>
</div>
</div>
</div>

<div id="outline-container-org0d00566" class="outline-3">
<h3 id="org0d00566"><span class="section-number-3">4.3</span> Formated Input: <code>scanf()</code></h3>
<div class="outline-text-3" id="text-4-3">
<p>
p171.
</p>
</div>

<div id="outline-container-orgf23ea64" class="outline-4">
<h4 id="orgf23ea64"><span class="section-number-4">4.3.1</span> A simple example</h4>
<div class="outline-text-4" id="text-4-3-1">
<p>
An example of using <code>scanf()</code>:
</p>
<div class="org-src-container">
<pre class="src src-c">#include &lt;stdio.h&gt;

int main() {
  int a;
  int b;
  int c;
  int d;
  int num;
  scanf("%d%d%d%d", &amp;a, &amp;b, &amp;c, &amp;d);
  printf("a = %d\nb = %d\nc = %d\nd = %d\n", a, b, c, d);

  return 0;
}
</pre>
</div>
<p>
here, we read four inputs and store them to four variables. Notice we have to pass in the address of each variable to <code>scanf()</code>. In this way, <code>scanf()</code> can modify the variable directly (passed by value).
</p>
</div>
</div>

<div id="outline-container-orgbdebf96" class="outline-4">
<h4 id="orgbdebf96"><span class="section-number-4">4.3.2</span> Declaration and arguments</h4>
<div class="outline-text-4" id="text-4-3-2">
<p>
<code>scanf()</code> is declared as:
</p>
<div class="org-src-container">
<pre class="src src-c">int scanf(char *format, ...)
</pre>
</div>

<p>
It will use the <code>format</code> string to retrieve information via certain format, convert them and assign to variables in the followed list. <code>scanf()</code> stops when it exhausts its format string, or when some input fails to match the control specification. It returns the number of successfully matched and assigned input items (to variable in the unamed argument lists).
</p>

<p>
The <code>format</code> string may contain:
</p>
<ol class="org-ol">
<li>blanks or tabs. These will be automatically ignored</li>
<li><p>
ordinary characters (not <code>%</code>). <code>scanf()</code> will try to match these characters with the corresponding non-whitespace character of the input stream. For example:
</p>
<div class="org-src-container">
<pre class="src src-c">scanf("%dabcde%d", &amp;a, &amp;b);
printf("a = %d\nb = %d\n", a, b);
</pre>
</div>
<p>
input: <code>1abcde2</code>, output:
</p>
<pre class="example">
a = 1
b = 2
</pre></li>
<li>conversion specifications, which is explained below.</li>
</ol>

<p>
A conversion specification is some characters starting with <code>%</code>, which will be used by <code>scanf()</code> to convert the next <b>input field</b> and assign to corresponding variable. An input field is defined as a string of non-white space characters; it extends either to the next white space character or until the field width has been reached (the width of the field may be specified by conversion specification, see below).
</p>

<p>
In the conversion specification, we may find:
</p>
<ul class="org-ul">
<li>%: indicating starting of a conversion specification</li>
<li>*: assignment suppresion marker. If this is present, the input field is skipped, no assignment to variable is made</li>
<li>number: a number that specifies the maximum width of the input field (of which this current conversion specification is taking care)</li>
<li><code>h, l or L</code>: indicating the width of the target. <code>%h</code>: a short integer; <code>%l</code>: a long integer.</li>
<li>a conversion character: indicating what type to convert to, like <code>%d, %c, %s</code> etc. (i.e. the interpretation of the input field).</li>
</ul>

<p>
Some examples of using <code>scanf()</code> can be found on p172, 173.
</p>
</div>
</div>
</div>

<div id="outline-container-org905f670" class="outline-3">
<h3 id="org905f670"><span class="section-number-3">4.4</span> File Access<a id="orgff7d961"></a></h3>
<div class="outline-text-3" id="text-4-4">
</div>
<div id="outline-container-org3f1c769" class="outline-4">
<h4 id="org3f1c769"><span class="section-number-4">4.4.1</span> Opening a file</h4>
<div class="outline-text-4" id="text-4-4-1">
<p>
The <code>&lt;stdio.h&gt;</code> library has a type <code>FILE</code> and a function <code>fopen()</code> that provides tools to work on files. The function <code>fopen()</code>'s declaration is as follows:
</p>
<div class="org-src-container">
<pre class="src src-c">FILE *fopen(char* name, char* mode)
</pre>
</div>
<p>
It accepts the name of the file and mode for opening this file. It will return a pointer to a <code>FILE</code> object. The type <code>FILE</code> is defined with a <code>typedef</code>, and is a structure that contains information about the file, such as:
</p>
<ul class="org-ul">
<li>a pointer to a buffer
<ul class="org-ul">
<li>a buffer is used so file can be read in large chunks</li>
</ul></li>
<li>a count of the number of characters left in the buffer</li>
<li>a pointer to the next character position in the buffer</li>
<li>the file descriptor</li>
<li>flags describing:
<ul class="org-ul">
<li>file openning mode: read or write</li>
<li>error states: if error has occurred</li>
<li>EOF states: whether end of file has occurred</li>
</ul></li>
</ul>

<p>
To obtain a pointer to a file, we do:
</p>
<div class="org-src-container">
<pre class="src src-c">FILE* fp;
fp = fopen(name, mode);
</pre>
</div>
<p>
the allowable modes include:
</p>
<ul class="org-ul">
<li>r: read mode</li>
<li>w: write mode</li>
<li>a: append mode</li>
<li>b: append b to open in binary mode (for some systems)</li>
</ul>

<p>
When errors occurred during file opening, <code>fopen()</code> will return a <code>NULL</code>.
</p>
</div>
</div>
<div id="outline-container-org1bbc8d8" class="outline-4">
<h4 id="org1bbc8d8"><span class="section-number-4">4.4.2</span> Accessing the file</h4>
<div class="outline-text-4" id="text-4-4-2">
<p>
Once the file is opened, we access it through the <code>FILE</code> pointer <code>fp</code>. We have following choices:
</p>
<ul class="org-ul">
<li><code>char getc(FILE *fp)</code>: (maybe) a macro that accepts a <code>FILE</code> pointer, returns the next character from the file (character position is recorded inside the <code>FILE</code> object). It returns <code>EOF</code> for end of file or error.</li>
<li><code>char putc(char c, FILE *fp)</code>: (maybe) a macro that accepts a character <code>c</code> and a <code>FILE</code> pointer. It will write <code>c</code> to the file and returns the character written, or returns <code>EOF</code> if an error occurs.</li>
</ul>

<p>
After using the file, we have to call <code>fclose()</code> to disconnect program from the file, freeing the file pointer for another file.
</p>
</div>
</div>
