Computer Science/C Notes/C_notes.org
*** ~stdin~, ~stdout~ and ~stderr~
When a C program is started, the operating system environment is responsible for opening three files and providing file pointers for them to the program. These files are:
- standard input, file pointer: ~stdin~
- standard output, file pointer: ~stdout~
- standard error, file pointer: ~stderr~
These file pointers are declared in ~<stdio.h>~. Normally, ~stdin~ is connected to the keyboard, ~stdout~ and ~stderr~ are connected to the screen. ~stdin~ and ~stdout~ may be redirected to files or pipes as described earlier. Pay attention that ~stderr~ normally appears on the screen even if the standard output is redirected, this prevents error message disappearing down the pipeline. 

Since C programs use these three file pointers to communicate with outside components, when we get char from input, or print char on output, we are actually getting or printing these characters via these file pointers to the final destination (standard input, standard output and standard error). Thus, ~getchar()~ and ~putchar(c)~ can be defined in terms of ~getc, putc, stdin~ and ~stdout~ as:
#+begin_src c
#define getchar() getc(stdin)
#define putchar(c) putc((c), stdout)
#+end_src

*** Formatted input and output of files
To format input or output of files, we can use ~fscanf()~ and ~fprintf()~. These functions are similar with ~scanf()~ and ~printf()~, except the first argument is a file pointer. The declaration of these two functions are:
#+begin_src c
int fscanf(FILE *fp, char* format, ...)
int fprintf(FILE *fp, char* format, ...)
#+end_src

An example of sending formated error message to ~stderr~ is:
#+begin_src c
fprintf(stderr, "Error occurred!\n");
#+end_src
*** Example: replicate program ~cat~
p176: normal error handling

p177: advanced error handling (using ~stderr~ and ~exit()~)
*** Line input and output
The standard library provides an input routine ~fgets()~, which can reads the next input line (including ~'\n'~ character) from a ~FILE~ pointer to a char array. It will return a ~char~ pointer pointing to this char array. Its declaration is as follows:
#+begin_src c
char *fgets(char* line, int maxline, FILE *fp);
#+end_src
At most ~maxline - 1~ characters will be read. The resulting line is automatically terminated with ~'\0'~. When end of file reached or error occurred, it returns ~NULL~.

The standard library provides an output routine ~fputs()~, which can write a string (which need not contain a newline) to a file. The declaration is as follows:
#+begin_src c
int fputs(char* line, FILE *fp);
#+end_src
It returns ~EOF~ if an error occurs, and zero otherwise.

The library functions ~gets~ and ~puts~ are similar to ~fgets~ and ~fputs~, but operate on ~FILE~ pointers ~stdin~ and ~stdout~. ~gets~ deletes the terminal ~'\n'~, and ~puts~ adds it.
** MISC Functions
*** Storage Management
Two functions are used to obtain blocks of memory dynamically:
#+begin_src c
void* malloc(size_t n);
void* calloc(size_t n, size_t size);
#+end_src

~malloc()~ will return a pointer to ~n~ bytes of uninitialized storage, or ~NULL~ if the request cannot be satisfied.

~calloc()~ will return a pointer to enough space for an array of ~n~ objects of the specified size, or ~NULL~ if the request cannot be satisfied. The storage is initialized to zero.

The pointer returned by ~malloc()~ or ~calloc()~ has the proper alignment for the object requested (proper amount of memory), however, it must be case into the appropriate type before assigning to a pointer to hold. For example:
#+begin_src c
int* ip;
ip = (int*) calloc(n, sizeof(int));
#+end_src

To free the space pointed by a pointer ~p~, of which initially obtained by a call to ~malloc()~ or ~calloc()~, we can call ~free(p)~.
* The UNIX System Interface
