Computer Science/C Notes/C_notes.html

<div id="outline-container-org30b38a1" class="outline-4">
<h4 id="org30b38a1"><span class="section-number-4">4.4.3</span> <code>stdin</code>, <code>stdout</code> and <code>stderr</code></h4>
<div class="outline-text-4" id="text-4-4-3">
<p>
When a C program is started, the operating system environment is responsible for opening three files and providing file pointers for them to the program. These files are:
</p>
<ul class="org-ul">
<li>standard input, file pointer: <code>stdin</code></li>
<li>standard output, file pointer: <code>stdout</code></li>
<li>standard error, file pointer: <code>stderr</code></li>
</ul>
<p>
These file pointers are declared in <code>&lt;stdio.h&gt;</code>. Normally, <code>stdin</code> is connected to the keyboard, <code>stdout</code> and <code>stderr</code> are connected to the screen. <code>stdin</code> and <code>stdout</code> may be redirected to files or pipes as described earlier. Pay attention that <code>stderr</code> normally appears on the screen even if the standard output is redirected, this prevents error message disappearing down the pipeline. 
</p>

<p>
Since C programs use these three file pointers to communicate with outside components, when we get char from input, or print char on output, we are actually getting or printing these characters via these file pointers to the final destination (standard input, standard output and standard error). Thus, <code>getchar()</code> and <code>putchar(c)</code> can be defined in terms of <code>getc, putc, stdin</code> and <code>stdout</code> as:
</p>
<div class="org-src-container">
<pre class="src src-c">#define getchar() getc(stdin)
#define putchar(c) putc((c), stdout)
</pre>
</div>
</div>
</div>

<div id="outline-container-org22a8344" class="outline-4">
<h4 id="org22a8344"><span class="section-number-4">4.4.4</span> Formatted input and output of files</h4>
<div class="outline-text-4" id="text-4-4-4">
<p>
To format input or output of files, we can use <code>fscanf()</code> and <code>fprintf()</code>. These functions are similar with <code>scanf()</code> and <code>printf()</code>, except the first argument is a file pointer. The declaration of these two functions are:
</p>
<div class="org-src-container">
<pre class="src src-c">int fscanf(FILE *fp, char* format, ...)
int fprintf(FILE *fp, char* format, ...)
</pre>
</div>

<p>
An example of sending formated error message to <code>stderr</code> is:
</p>
<div class="org-src-container">
<pre class="src src-c">fprintf(stderr, "Error occurred!\n");
</pre>
</div>
</div>
</div>
<div id="outline-container-org3e888ad" class="outline-4">
<h4 id="org3e888ad"><span class="section-number-4">4.4.5</span> Example: replicate program <code>cat</code></h4>
<div class="outline-text-4" id="text-4-4-5">
<p>
p176: normal error handling
</p>

<p>
p177: advanced error handling (using <code>stderr</code> and <code>exit()</code>)
</p>
</div>
</div>
<div id="outline-container-org3c0197a" class="outline-4">
<h4 id="org3c0197a"><span class="section-number-4">4.4.6</span> Line input and output</h4>
<div class="outline-text-4" id="text-4-4-6">
<p>
The standard library provides an input routine <code>fgets()</code>, which can reads the next input line (including <code>'\n'</code> character) from a <code>FILE</code> pointer to a char array. It will return a <code>char</code> pointer pointing to this char array. Its declaration is as follows:
</p>
<div class="org-src-container">
<pre class="src src-c">char *fgets(char* line, int maxline, FILE *fp);
</pre>
</div>
<p>
At most <code>maxline - 1</code> characters will be read. The resulting line is automatically terminated with <code>'\0'</code>. When end of file reached or error occurred, it returns <code>NULL</code>.
</p>

<p>
The standard library provides an output routine <code>fputs()</code>, which can write a string (which need not contain a newline) to a file. The declaration is as follows:
</p>
<div class="org-src-container">
<pre class="src src-c">int fputs(char* line, FILE *fp);
</pre>
</div>
<p>
It returns <code>EOF</code> if an error occurs, and zero otherwise.
</p>

<p>
The library functions <code>gets</code> and <code>puts</code> are similar to <code>fgets</code> and <code>fputs</code>, but operate on <code>FILE</code> pointers <code>stdin</code> and <code>stdout</code>. <code>gets</code> deletes the terminal <code>'\n'</code>, and <code>puts</code> adds it.
</p>
</div>
</div>
</div>
<div id="outline-container-org35cbc64" class="outline-3">
<h3 id="org35cbc64"><span class="section-number-3">4.5</span> MISC Functions</h3>
<div class="outline-text-3" id="text-4-5">
</div>
<div id="outline-container-orgd8f5399" class="outline-4">
<h4 id="orgd8f5399"><span class="section-number-4">4.5.1</span> Storage Management</h4>
<div class="outline-text-4" id="text-4-5-1">
<p>
Two functions are used to obtain blocks of memory dynamically:
</p>
<div class="org-src-container">
<pre class="src src-c">void* malloc(size_t n);
void* calloc(size_t n, size_t size);
</pre>
</div>

<p>
<code>malloc()</code> will return a pointer to <code>n</code> bytes of uninitialized storage, or <code>NULL</code> if the request cannot be satisfied.
</p>

<p>
<code>calloc()</code> will return a pointer to enough space for an array of <code>n</code> objects of the specified size, or <code>NULL</code> if the request cannot be satisfied. The storage is initialized to zero.
</p>

<p>
The pointer returned by <code>malloc()</code> or <code>calloc()</code> has the proper alignment for the object requested (proper amount of memory), however, it must be case into the appropriate type before assigning to a pointer to hold. For example:
</p>
<div class="org-src-container">
<pre class="src src-c">int* ip;
ip = (int*) calloc(n, sizeof(int));
</pre>
</div>

<p>
To free the space pointed by a pointer <code>p</code>, of which initially obtained by a call to <code>malloc()</code> or <code>calloc()</code>, we can call <code>free(p)</code>.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org58ee376" class="outline-2">
<h2 id="org58ee376"><span class="section-number-2">5</span> The UNIX System Interface</h2>
<div class="outline-text-2" id="text-5">
</div>
