Computer Science/C Notes/C_notes.org
** File Descriptors
In the UNIX operating system, all input and output is done by reading or writing files. All peripheral devices are abstracted as files in the file system. So, a single homogeneous interface handles all communication between a program and peripheral devices.

Consider an example of a C program that read content from, or write content to files on the system. Before you can do this, you must inform the system that you wish to *ACCESS* that particular file. The system will check your right to do so (does the file exist? do you have permission to access it?). If you have the access, the system will return a *small non-negative integer* called a /file descriptor/.

A file descriptor is a small non-negative integer, which is an abstract indicator (handle) used to access a file on the system (a file can be an actual file, a pipe, a network socket). All information about an open file is maintained by the system, the user program refers to the file only by the file descriptor.

As mentioned, the input/output are also abstracted as files on the system. If a program wants to access them, it must intend the system to check acceesbility and return the corresponding file descriptors to the program. However, since input/output are used so commonly, that when a program is called by the command interpreter (the "shell"), three files will be opened, their file descriptors ~0~, ~1~ and ~2~, will be returned to program so it can use it. By default, the three files are keyboard file (for input), monitor file and monitor file (for output and error display). In fact, the three file descriptors ~0~, ~1~ and ~2~, are used as ways for standard input, standard output and standard error of the program. The program don't have to worry about opening files to use them.

The user of a program can redirect I/O to and from files with ~<~ and ~>~ when typing the shell command. If these symbols are used, the default assignment of file descriptor ~0~ and ~1~ will be changed to the named files. For example:
#+BEGIN_EXAMPLE
$prog < text1.txt
#+END_EXAMPLE
In the above example, the ~text1.txt~ file will replace keyboard file as the standard input file, system will use file descriptor ~0~ to identify ~text1.txt~ and return file descriptor ~0~ to ~prog~. ~prog~ will use file descriptor ~0~ to get input.

Similarly, for standard output redirect:
#+BEGIN_EXAMPLE
$prog > result.txt
#+END_EXAMPLE
the ~result.txt~ file will replace monitor file as the standard output file, system will use file descriptor ~1~ to identify ~result.txt~ and return file descriptor ~1~ to ~prog~. ~prog~ will use file descriptor ~1~ to do output.

Pay attention that, the change of file assignments are done by the shell, not the program. For program, it always deal with file descriptor ~0~, ~1~ and ~2~. It does not know where is input coming from and where is output going to.
** Low Level I/O: ~read()~ and ~write()~
Input and output uses the ~read~ and ~write~ system calls. These two system calls are accessed from C programs through two functions called [[http://man7.org/linux/man-pages/man2/read.2.html][~read()~]] and [[http://man7.org/linux/man-pages/man2/write.2.html][~write()~]]. To use these two functions, you have to ~#include <unistd.h>~.
*** ~read()~
The function header for ~read()~ is:
#+begin_src c
ssize_t read(int fd, char *buf, size_t count)
#+end_src
*Parameters*

- ~fd~: file descriptor, referring the file you wish to read data from
- ~buf~: a pointer to a chunk of memory where the program store the data read from the file. Should be a pointer to a char or an array of char, since each char type is one byte. The data is read byte-by-byte.
- ~count~: amount of information you want to read from the file in one call of ~read()~, in bytes

*Behavior*

~read(fd, buf, count)~ attempts to read up to ~count~ bytes from the file referred to by the file descriptor ~fd~ into the buffer started at ~buf~.

*Return Value*

The return value of ~read()~ can be:
1. the number of bytes read from ~fd~. When ~fd~ doesn't have enough data, the returned value may be smaller than ~count~.
2. 0. This indicates end of file has been reached, nothing is read from ~fd~.
3. -1. This indicates error occurred.

Any number of bytes can be read in one call. The most common values are 1, which means one character at a time ("unbuffered"), or a number like 1024 or 4096 that corresponds to a physical block size on a peripheral device. Larger sizes will be more efficient because fewer system calls will be made.
*** ~write()~
The function header for ~write()~ is:
#+begin_src c
ssize_t write(int fd, char *buf, size_t count)
#+end_src

*Parameters*

- ~fd~: the file descriptor referring the file you want to write data to
- ~buf~: a pointer to a chunk of memory where the program store the data ready to be written to the file. Should be a pointer to a char or an array of char, since each char type is one byte. The data is read byte-by-byte.
- ~count~: amount of information you want to write to the file in one call of ~write()~, in bytes

*Behavior*

~write(fd, buf, count)~ writes up to ~count~ bytes from the buffer starting at ~buf~ to the file referred to by the file descriptor ~fd~.

*Return Value*

The return value of ~write()~ can be:
1. the number of bytes written to ~fd~. If this number is different from ~count~, it indicates an error has occurred, for example: there is insufficient space on the underlying physical medium. This can be used to do error checking.

Any number of bytes can be written in one call, as mentioned in ~read()~.
