Computer Science/C Notes/C_notes.html
<div id="outline-container-orgf245e9f" class="outline-3">
<h3 id="orgf245e9f"><span class="section-number-3">5.1</span> File Descriptors</h3>
<div class="outline-text-3" id="text-5-1">
<p>
In the UNIX operating system, all input and output is done by reading or writing files. All peripheral devices are abstracted as files in the file system. So, a single homogeneous interface handles all communication between a program and peripheral devices.
</p>

<p>
Consider an example of a C program that read content from, or write content to files on the system. Before you can do this, you must inform the system that you wish to <b>ACCESS</b> that particular file. The system will check your right to do so (does the file exist? do you have permission to access it?). If you have the access, the system will return a <b>small non-negative integer</b> called a <i>file descriptor</i>.
</p>

<p>
A file descriptor is a small non-negative integer, which is an abstract indicator (handle) used to access a file on the system (a file can be an actual file, a pipe, a network socket). All information about an open file is maintained by the system, the user program refers to the file only by the file descriptor.
</p>

<p>
As mentioned, the input/output are also abstracted as files on the system. If a program wants to access them, it must intend the system to check acceesbility and return the corresponding file descriptors to the program. However, since input/output are used so commonly, that when a program is called by the command interpreter (the "shell"), three files will be opened, their file descriptors <code>0</code>, <code>1</code> and <code>2</code>, will be returned to program so it can use it. By default, the three files are keyboard file (for input), monitor file and monitor file (for output and error display). In fact, the three file descriptors <code>0</code>, <code>1</code> and <code>2</code>, are used as ways for standard input, standard output and standard error of the program. The program don't have to worry about opening files to use them.
</p>

<p>
The user of a program can redirect I/O to and from files with <code>&lt;</code> and <code>&gt;</code> when typing the shell command. If these symbols are used, the default assignment of file descriptor <code>0</code> and <code>1</code> will be changed to the named files. For example:
</p>
<pre class="example">
$prog &lt; text1.txt
</pre>
<p>
In the above example, the <code>text1.txt</code> file will replace keyboard file as the standard input file, system will use file descriptor <code>0</code> to identify <code>text1.txt</code> and return file descriptor <code>0</code> to <code>prog</code>. <code>prog</code> will use file descriptor <code>0</code> to get input.
</p>

<p>
Similarly, for standard output redirect:
</p>
<pre class="example">
$prog &gt; result.txt
</pre>
<p>
the <code>result.txt</code> file will replace monitor file as the standard output file, system will use file descriptor <code>1</code> to identify <code>result.txt</code> and return file descriptor <code>1</code> to <code>prog</code>. <code>prog</code> will use file descriptor <code>1</code> to do output.
</p>

<p>
Pay attention that, the change of file assignments are done by the shell, not the program. For program, it always deal with file descriptor <code>0</code>, <code>1</code> and <code>2</code>. It does not know where is input coming from and where is output going to.
</p>
</div>
</div>
<div id="outline-container-orga6073cf" class="outline-3">
<h3 id="orga6073cf"><span class="section-number-3">5.2</span> Low Level I/O: <code>read()</code> and <code>write()</code></h3>
<div class="outline-text-3" id="text-5-2">
<p>
Input and output uses the <code>read</code> and <code>write</code> system calls. These two system calls are accessed from C programs through two functions called <a href="http://man7.org/linux/man-pages/man2/read.2.html"><code>read()</code></a> and <a href="http://man7.org/linux/man-pages/man2/write.2.html"><code>write()</code></a>. To use these two functions, you have to <code>#include &lt;unistd.h&gt;</code>.
</p>
</div>
<div id="outline-container-org5542581" class="outline-4">
<h4 id="org5542581"><span class="section-number-4">5.2.1</span> <code>read()</code></h4>
<div class="outline-text-4" id="text-5-2-1">
<p>
The function header for <code>read()</code> is:
</p>
<div class="org-src-container">
<pre class="src src-c">ssize_t read(int fd, char *buf, size_t count)
</pre>
</div>
<p>
<b>Parameters</b>
</p>

<ul class="org-ul">
<li><code>fd</code>: file descriptor, referring the file you wish to read data from</li>
<li><code>buf</code>: a pointer to a chunk of memory where the program store the data read from the file. Should be a pointer to a char or an array of char, since each char type is one byte. The data is read byte-by-byte.</li>
<li><code>count</code>: amount of information you want to read from the file in one call of <code>read()</code>, in bytes</li>
</ul>

<p>
<b>Behavior</b>
</p>

<p>
<code>read(fd, buf, count)</code> attempts to read up to <code>count</code> bytes from the file referred to by the file descriptor <code>fd</code> into the buffer started at <code>buf</code>.
</p>

<p>
<b>Return Value</b>
</p>

<p>
The return value of <code>read()</code> can be:
</p>
<ol class="org-ol">
<li>the number of bytes read from <code>fd</code>. When <code>fd</code> doesn't have enough data, the returned value may be smaller than <code>count</code>.</li>
<li>0. This indicates end of file has been reached, nothing is read from <code>fd</code>.</li>
<li>-1. This indicates error occurred.</li>
</ol>

<p>
Any number of bytes can be read in one call. The most common values are 1, which means one character at a time ("unbuffered"), or a number like 1024 or 4096 that corresponds to a physical block size on a peripheral device. Larger sizes will be more efficient because fewer system calls will be made.
</p>
</div>
</div>
<div id="outline-container-org2faabc1" class="outline-4">
<h4 id="org2faabc1"><span class="section-number-4">5.2.2</span> <code>write()</code></h4>
<div class="outline-text-4" id="text-5-2-2">
<p>
The function header for <code>write()</code> is:
</p>
<div class="org-src-container">
<pre class="src src-c">ssize_t write(int fd, char *buf, size_t count)
</pre>
</div>

<p>
<b>Parameters</b>
</p>

<ul class="org-ul">
<li><code>fd</code>: the file descriptor referring the file you want to write data to</li>
<li><code>buf</code>: a pointer to a chunk of memory where the program store the data ready to be written to the file. Should be a pointer to a char or an array of char, since each char type is one byte. The data is read byte-by-byte.</li>
<li><code>count</code>: amount of information you want to write to the file in one call of <code>write()</code>, in bytes</li>
</ul>

<p>
<b>Behavior</b>
</p>

<p>
<code>write(fd, buf, count)</code> writes up to <code>count</code> bytes from the buffer starting at <code>buf</code> to the file referred to by the file descriptor <code>fd</code>.
</p>

<p>
<b>Return Value</b>
</p>

<p>
The return value of <code>write()</code> can be:
</p>
<ol class="org-ol">
<li>the number of bytes written to <code>fd</code>. If this number is different from <code>count</code>, it indicates an error has occurred, for example: there is insufficient space on the underlying physical medium. This can be used to do error checking.</li>
</ol>

<p>
Any number of bytes can be written in one call, as mentioned in <code>read()</code>.
</p>
</div>
</div>
