Computer Science/C Notes/C_notes.org
*** Example: copy input to output
This example will show the basic use of ~read()~ and ~write()~ function. In order to receive what we read from ~read()~, we need a buffer to hold it. We read data from ~fd~ to the buffer, and call ~write()~ to put the content in buffer to ~fd~. We repeat this process until the returned value of ~read()~ is not positive (0 or -1).

We'll use ~0~ as the file descriptor in ~read()~, since this is the standard input file descriptor. We'll use ~1~ as the file descriptor in ~write()~, since this is the standard output file descriptor. The code is as follows:
#+begin_src c
#include <unistd.h>

#define BUFSIZ 5
/* copy input to output */
int main() {
  char buf[BUFSIZ];
  int n;  // hold the number of bytes read
  
  while ((n = read(0, buf, BUFSIZ)) > 0)
    write(1, buf, n);
  
  return 0;
}
#+end_src
The buffer size is defined as 5. This means each system call we'll process 5 characters. But the reading will not stop unless 0 or -1 is returned by ~read()~. If file descriptor ~0~ is referring keyboard file (keyboard is the standard input), it will continue to read until the keyboard buffer is empty, then the program will wait until the user type other things (I guess these typed-in characters will first go to the keyboard buffer, then they will be read by program). For example, if we print the number of characters being read during each while loop, by adding ~printf("\n%d characters has been read.\n", n);~ into the while loop. Then we call the program (use default standard input), and input: ~12345678~, the result in console would be:
#+BEGIN_EXAMPLE
12345678
12345
5 characters has been read.
678

4 characters has been read.
#+END_EXAMPLE
Notice that each call of ~read()~ only read 5 characters.
*** Example: ~getchar()~
We can use ~read()~ to construct ~getchar()~, which is higher-level routine. First, let's compare the function header of these two functions:
#+begin_src c
ssize_t read(int fd, char *buf, size_t count)
char getchar(void)
#+end_src
Function ~getchar()~ has no parameter, it returns one character that is read from input stream. It does not require the user of ~getchar()~ bother the idea of file descriptor, buffer or the number of characters read. It conceals these details in its implementation so user can use it directly in the expected way. This is an example of using lower-level bricks to build higher level structures in the software architecture.

The implementation is simple:
#+begin_src c
#include <unistd.h>
#include <stdio.h>

char getcharacter(void) {
  char c;
  return ((read(0, &c, 1)) == 1) ? c : EOF;
}

int main() {
  char c;
  
  while ((c = getcharacter()) != EOF)
    printf("%c", c);
  return 0;
}
#+end_src
** ~open()~, ~creat()~, ~close()~, ~unlink()~
When a C program is invoked, only the three default files will be automatically opened and linked to the program (they are standard input, standard output and standard error files, refered by file descriptors ~0~, ~1~ and ~2~).

If you want to work with other files, you have to explicitly open other files in order to read or write them. In section [[file_access][File Access]], we mentioned a way of operating files by routines defined in ~<stdio.h>~. Here, we introduce low-level system calls to do this.

There are two system calls for file operation: ~open()~ and ~creat()~. To use them in your C program, you have to ~#include <fcntl.h>~.
*** ~open()~
**** Generals
The documentation for ~open()~ can be found [[http://man7.org/linux/man-pages/man2/open.2.html][here]].

The header of this system call is:
#+begin_src c
int open(char *name, int flags, int perms);
#+end_src
*Parameters*
- ~name~: the file name you want to open
- ~flags~: an ~int~ that specifies how the file is to be opened (constants are defined in ~<fcntl.h>~):
  - ~O_RDONLY~: open for read-only
  - ~O_WRONLY~: open for write-only
  - ~O_RDWR~: open for reading and writing
- ~perms~: (not mentioned in the book), it is always zero for the uses of ~open()~ that we will discuss)

Notice that when openning a file, the content of the file will not be deleted.
    
*Return value*

If successful, the return value of ~open()~ is a file descriptor, it will be the lowest-numbered file descriptor not currently open for the process. The file descriptor can be used by subsequent system calls, such as ~read()~, ~write()~.

If not successful, return -1.

**** Example: open a file for reading 
The code is as follows:
#+begin_src c
#include <fcntl.h>

int fd;  // to hold file descriptor
char name[] = "abc.txt";  // the file name
fd = open(name, O_RDONLY, 0)
#+end_src
*** ~creat()~
**** Generals
The documentation for ~creat()~ can be found [[https://linux.die.net/man/3/creat][here]].

The header of this system call is:
#+begin_src c
int creat(char *name, int perms);
#+end_src
*Parameters*
- ~name~: the file name to be created
- ~perms~: this integer specifies the permission of the file to be created. UNIX file system associates a small integer (with a length of 9-bits) with each file to specify the permission information of them. This integer controls different types of access by different users:
  - Access types:
    - read
    - write
    - execute
  - User types:
    - owner of the file
    - the owner's group
    - all others
  This is a 9-bit long integer, so we can use a 3-digit octal number for specifying the permissions. For example, ~0755~ (octal number for: ~1 1110 1101~) specifies read, write and execute permission for the owner; and read, execute permission for all others.


*Return value*

~creat()~ will return a file descriptor if it was able to creat the file. Otherwise, it will return -1.

If the file already exists, ~creat()~ will truncate it to zero length.
*** ~close()~
The function ~close(int fd)~ breaks the connection between a file descriptor and an open file, and frees the file descriptor for use with some other file.
*** ~unlink()~
The function ~unlink(char *name)~ removes the file ~name~ from the file system.

