Computer Science/C Notes/C_notes.html
<div id="outline-container-orgbbbc964" class="outline-4">
<h4 id="orgbbbc964"><span class="section-number-4">5.2.3</span> Example: copy input to output</h4>
<div class="outline-text-4" id="text-5-2-3">
<p>
This example will show the basic use of <code>read()</code> and <code>write()</code> function. In order to receive what we read from <code>read()</code>, we need a buffer to hold it. We read data from <code>fd</code> to the buffer, and call <code>write()</code> to put the content in buffer to <code>fd</code>. We repeat this process until the returned value of <code>read()</code> is not positive (0 or -1).
</p>

<p>
We'll use <code>0</code> as the file descriptor in <code>read()</code>, since this is the standard input file descriptor. We'll use <code>1</code> as the file descriptor in <code>write()</code>, since this is the standard output file descriptor. The code is as follows:
</p>
<div class="org-src-container">
<pre class="src src-c">#include &lt;unistd.h&gt;

#define BUFSIZ 5
/* copy input to output */
int main() {
  char buf[BUFSIZ];
  int n;  // hold the number of bytes read

  while ((n = read(0, buf, BUFSIZ)) &gt; 0)
    write(1, buf, n);

  return 0;
}
</pre>
</div>
<p>
The buffer size is defined as 5. This means each system call we'll process 5 characters. But the reading will not stop unless 0 or -1 is returned by <code>read()</code>. If file descriptor <code>0</code> is referring keyboard file (keyboard is the standard input), it will continue to read until the keyboard buffer is empty, then the program will wait until the user type other things (I guess these typed-in characters will first go to the keyboard buffer, then they will be read by program). For example, if we print the number of characters being read during each while loop, by adding <code>printf("\n%d characters has been read.\n", n);</code> into the while loop. Then we call the program (use default standard input), and input: <code>12345678</code>, the result in console would be:
</p>
<pre class="example">
12345678
12345
5 characters has been read.
678

4 characters has been read.
</pre>
<p>
Notice that each call of <code>read()</code> only read 5 characters.
</p>
</div>
</div>
<div id="outline-container-org9adde13" class="outline-4">
<h4 id="org9adde13"><span class="section-number-4">5.2.4</span> Example: <code>getchar()</code></h4>
<div class="outline-text-4" id="text-5-2-4">
<p>
We can use <code>read()</code> to construct <code>getchar()</code>, which is higher-level routine. First, let's compare the function header of these two functions:
</p>
<div class="org-src-container">
<pre class="src src-c">ssize_t read(int fd, char *buf, size_t count)
char getchar(void)
</pre>
</div>
<p>
Function <code>getchar()</code> has no parameter, it returns one character that is read from input stream. It does not require the user of <code>getchar()</code> bother the idea of file descriptor, buffer or the number of characters read. It conceals these details in its implementation so user can use it directly in the expected way. This is an example of using lower-level bricks to build higher level structures in the software architecture.
</p>

<p>
The implementation is simple:
</p>
<div class="org-src-container">
<pre class="src src-c">#include &lt;unistd.h&gt;
#include &lt;stdio.h&gt;

char getcharacter(void) {
  char c;
  return ((read(0, &amp;c, 1)) == 1) ? c : EOF;
}

int main() {
  char c;

  while ((c = getcharacter()) != EOF)
    printf("%c", c);
  return 0;
}
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgdf5ff0d" class="outline-3">
<h3 id="orgdf5ff0d"><span class="section-number-3">5.3</span> <code>open()</code>, <code>creat()</code>, <code>close()</code>, <code>unlink()</code></h3>
<div class="outline-text-3" id="text-5-3">
<p>
When a C program is invoked, only the three default files will be automatically opened and linked to the program (they are standard input, standard output and standard error files, refered by file descriptors <code>0</code>, <code>1</code> and <code>2</code>).
</p>

<p>
If you want to work with other files, you have to explicitly open other files in order to read or write them. In section <a href="#orgff7d961">File Access</a>, we mentioned a way of operating files by routines defined in <code>&lt;stdio.h&gt;</code>. Here, we introduce low-level system calls to do this.
</p>

<p>
There are two system calls for file operation: <code>open()</code> and <code>creat()</code>. To use them in your C program, you have to <code>#include &lt;fcntl.h&gt;</code>.
</p>
</div>
<div id="outline-container-orgb8ec0ce" class="outline-4">
<h4 id="orgb8ec0ce"><span class="section-number-4">5.3.1</span> <code>open()</code></h4>
<div class="outline-text-4" id="text-5-3-1">
</div>
<div id="outline-container-orgb51859d" class="outline-5">
<h5 id="orgb51859d"><span class="section-number-5">5.3.1.1</span> Generals</h5>
<div class="outline-text-5" id="text-5-3-1-1">
<p>
The documentation for <code>open()</code> can be found <a href="http://man7.org/linux/man-pages/man2/open.2.html">here</a>.
</p>

<p>
The header of this system call is:
</p>
<div class="org-src-container">
<pre class="src src-c">int open(char *name, int flags, int perms);
</pre>
</div>
<p>
<b>Parameters</b>
</p>
<ul class="org-ul">
<li><code>name</code>: the file name you want to open</li>
<li><code>flags</code>: an <code>int</code> that specifies how the file is to be opened (constants are defined in <code>&lt;fcntl.h&gt;</code>):
<ul class="org-ul">
<li><code>O_RDONLY</code>: open for read-only</li>
<li><code>O_WRONLY</code>: open for write-only</li>
<li><code>O_RDWR</code>: open for reading and writing</li>
</ul></li>
<li><code>perms</code>: (not mentioned in the book), it is always zero for the uses of <code>open()</code> that we will discuss)</li>
</ul>


<p>
<b>Return value</b>
</p>

<p>
If successful, the return value of <code>open()</code> is a file descriptor, it will be the lowest-numbered file descriptor not currently open for the process. The file descriptor can be used by subsequent system calls, such as <code>read()</code>, <code>write()</code>.
</p>

<p>
If not successful, return -1.
</p>
</div>
</div>

<div id="outline-container-org4f2ffd7" class="outline-5">
<h5 id="org4f2ffd7"><span class="section-number-5">5.3.1.2</span> Example: open a file for reading</h5>
<div class="outline-text-5" id="text-5-3-1-2">
<p>
The code is as follows:
</p>
<div class="org-src-container">
<pre class="src src-c">#include &lt;fcntl.h&gt;

int fd;  // to hold file descriptor
char name[] = "abc.txt";  // the file name
fd = open(name, O_RDONLY, 0)
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org919ef90" class="outline-4">
<h4 id="org919ef90"><span class="section-number-4">5.3.2</span> <code>creat()</code></h4>
<div class="outline-text-4" id="text-5-3-2">
</div>
<div id="outline-container-org4bc1522" class="outline-5">
<h5 id="org4bc1522"><span class="section-number-5">5.3.2.1</span> Generals</h5>
<div class="outline-text-5" id="text-5-3-2-1">
<p>
The documentation for <code>creat()</code> can be found <a href="https://linux.die.net/man/3/creat">here</a>.
</p>

<p>
The header of this system call is:
</p>
<div class="org-src-container">
<pre class="src src-c">int creat(char *name, int perms);
</pre>
</div>
<p>
<b>Parameters</b>
</p>
<ul class="org-ul">
<li><code>name</code>: the file name to be created</li>
<li><p>
<code>perms</code>: this integer specifies the permission of the file to be created. UNIX file system associates a small integer (with a length of 9-bits) with each file to specify the permission information of them. This integer controls different types of access by different users:
</p>
<ul class="org-ul">
<li>Access types:
<ul class="org-ul">
<li>read</li>
<li>write</li>
<li>execute</li>
</ul></li>
<li>User types:
<ul class="org-ul">
<li>owner of the file</li>
<li>the owner's group</li>
<li>all others</li>
</ul></li>
</ul>
<p>
This is a 9-bit long integer, so we can use a 3-digit octal number for specifying the permissions. For example, <code>0755</code> (octal number for: <code>1 1110 1101</code>) specifies read, write and execute permission for the owner; and read, execute permission for all others.
</p></li>
</ul>


<p>
<b>Return value</b>
</p>

<p>
<code>creat()</code> will return a file descriptor if it was able to creat the file. Otherwise, it will return -1.
</p>

<p>
If the file already exists, <code>creat()</code> will truncate it to zero length.
</p>
</div>
</div>
</div>
<div id="outline-container-org5714e4b" class="outline-4">
<h4 id="org5714e4b"><span class="section-number-4">5.3.3</span> <code>close()</code></h4>
<div class="outline-text-4" id="text-5-3-3">
<p>
The function <code>close(int fd)</code> breaks the connection between a file descriptor and an open file, and frees the file descriptor for use with some other file.
</p>
</div>
</div>
<div id="outline-container-org2fa0f40" class="outline-4">
<h4 id="org2fa0f40"><span class="section-number-4">5.3.4</span> <code>unlink()</code></h4>
<div class="outline-text-4" id="text-5-3-4">
<p>
The function <code>unlink(char *name)</code> removes the file <code>name</code> from the file system.
</p>
</div>
</div>
