Computer Science/C Notes/C_notes.org
*** Example: mini ~cp~ program
This is a simple version of ~cp~ program. It copies one file to another. The file names are given as command line arguments. It will not copy the permission flag (the 3-digit octal number that describes the permission of the file), but invent a default permission of the copied file.

The behavior of the program is:
#+BEGIN_EXAMPLE
$ cp file_1 file_2
#+END_EXAMPLE
After typing the above line, a file named ~file_2~ will be created, with the same content as ~file_1~. 

How to copy? First, we have the file name from the command line argument (should be ~argv[1]~ and ~argv[2]~). We use system call ~open()~ to open the first file (the file being copied), and use system call ~creat()~ to create a file with name ~argv[2]~. We use two integer variable to hold the file descriptor returned by this two system calls. If no error occurred, we use ~read()~ system call to read content in ~file_1~ to our buffer, then use ~write()~ system call to write content in our buffer to the file. If there is any error occurred during the writing process (i.e. the returned value of ~write()~ is different from the intended value), we display error.

In this first version,we call ~printf()~ to display error message through standard output, and call ~exit(1)~ to exit the program. The code is as follows:
#+begin_src c
#include <stdio.h>   // for displaying error message
#include <stdlib.h>  // for exit() function
#include <unistd.h>  // for read(), write()
#include <fcntl.h>   // for open(), creat()
#define PERMS 0666   // default permission flag for copied file
                     // RW for owner, group, others
#define BUFFER 100   // buffer size for a single call of read()

/* cp: copy f1 to f2 */                    
int main(int argc, char *argv[]) {
  int fd1, fd2;  // hold two file descriptors
  int n;  // hold number of bytes read from file1
  char buf[BUFFER];

  // check number of command line arguments
  if (argc != 3) {
    printf("Usage: cp f1 f2");
    exit(1);
  }

  // oepn first file and create second file, exit if error occurred
  if ((fd1 = open(argv[1], O_RDONLY, 0)) == -1) {  // open failed
    printf("Error: can't open %s\n", argv[1]);
    exit(1);
  }

  if ((fd2 = creat(argv[2], PERMS)) == -1) {  // create failed
    printf("Error: can't create %s\n", argv[2]);
    exit(1);
  }

  // use read() and write() system to copy file
  while ((n = read(fd1, buf, BUFFER)) > 0)
    if (n != write(fd2, buf, n)) {  // check if write succeeded
      printf("Error: couldn't write on file %s\n", argv[2]);
      exit(1);
    }

  return 0;
}                    
#+end_src
*** Example: mini ~cp~ program with self-implemented ~error()~ display
Here, we implement a function called ~error()~ to combine following function calls:
1. ~printf("...", argv[...])~
2. ~exit(1)~

In short, it will display error information to standard error file, then call ~exit(1)~ to stop the program.

This is similar with the simple ~printf()~ function we built [[mini_printf][earlier]]. It is a function with variable-length argument lists. To process this kind of function, we ~#include <stdarg.h>~, and the header is:
#+begin_src c
void error(char *format, ...)
#+end_src
The three dots represents this function may have variable-length argument(s) after the named argument ~format~. To navigate each un-named argument, we declare a ~va_list~ type object and initialize it:
#+begin_src c
#include <stdarg.h>

void error(char *format, ...) {
  va_list args;
  va_start(args, format);
}
#+end_src

Then, we use ~fprintf()~ to print error message to ~stderr~ (this is a file pointer):
#+begin_src c
  fprintf(stderr, "error: ");
  vfprintf(stderr, format, args);
  fprintf(stderr, '\n');
#+end_src

Here, we use other version of ~fprintf()~ to print the argument related error message: ~vfprintf()~. Its header is as follows:
#+begin_src c
int vfprintf(FILE *fp, const char *format, va_list arg);
#+end_src

*Parameters*

- ~fp~: pointer to a ~FILE~ object that identifies an output stream
- ~format~: C string that contains a format string that follows the same specifications as in ~printf()~
- ~arg~ a variable of ~va_list~ type which has been initialized by calling the ~va_start~ macro.

*Return Value*

If succeed, the total number of characters written is returned.

*Behavior*

Writes the C string pointed by ~format~ to the file pointed by ~fp~, replacing any format specifier in the same way as ~printf()~ does, using the elements in the variable argument list identified by ~arg~, which is a ~va_list~ type object initialized by the ~va_start~ macro. So, we don't have to manually scan the ~format~ string and when a ~'%'~ is found, call ~va_arg()~ to retrieve the next argument in ~arg~ and print according to its type (check [[mini_printf][miniPrintf()]] for details of how this is done).

In another words, this function is like automatically extracting all arguments in ~arg~ and call:
#+begin_src c
fprintf(stderr, format, arg1, arg2, arg3);
#+end_src

After displaying error message, we call ~va_end()~ macro to end the argument retrieving. Then we call ~exit(1)~ to stop the program. The combined code is as follows:
#+begin_src c
#include <stdio.h>
#include <stdarg.h>
#include <stdlib.h>  // for exit() function

void error(char *format, ...) {
  va_list args;  // for retrieving arguments
  va_start(args, format);  // initialize args

  // print error messages
  fprintf(stderr, "error: ");
  vfprintf(stderr, format, args);
  fprintf(stderr, "\n");

  // call exit() to stop the program
  exit(1);
}
#+end_src

Now ~error()~ has been defined, we call ~error()~ directly when an error occurred, instead of ~printf()~ and ~exit()~. The code is as follows:
#+begin_src c
#include <stdio.h>
#include <stdarg.h>
#include <stdlib.h>
#include <fcntl.h>
#include <unistd.h>

#define PERMS 0666  // permission code: RW for owner, group, others
#define BUFFSIZE 100  // buffer size for read(), write()

void error(char *format, ...);

int main(int argc, char *argv[]) {
  int f1, f2, n;
  char buf[BUFFSIZE];

  // try to open files and display error message if failed
  if (argc != 3)  // check command line argument amount
    error("Usage: cp from to");
  if ((f1 = open(argv[1], O_RDONLY, 0)) == -1)
    error("cp: can't open %s", argv[1]);
  if ((f2 = creat(argv[2], PERMS)) == -1)
    error("cp: can't create %s, mode%03o", argv[2], PERMS);
    
  // copy
  while ((n = read(f1, buf, BUFFSIZE)) > 0)
    if (write(f2, buf, n) != n)
      error("cp: write error on file %s", argv[2]);

  return 0;
}
#+end_src
