Computer Science/C Notes/C_notes.html

<div id="outline-container-org0483087" class="outline-4">
<h4 id="org0483087"><span class="section-number-4">5.3.5</span> Example: mini <code>cp</code> program</h4>
<div class="outline-text-4" id="text-5-3-5">
<p>
This is a simple version of <code>cp</code> program. It copies one file to another. The file names are given as command line arguments. It will not copy the permission flag (the 3-digit octal number that describes the permission of the file), but invent a default permission of the copied file.
</p>

<p>
The behavior of the program is:
</p>
<pre class="example">
$ cp file_1 file_2
</pre>
<p>
After typing the above line, a file named <code>file_2</code> will be created, with the same content as <code>file_1</code>. 
</p>

<p>
How to copy? First, we have the file name from the command line argument (should be <code>argv[1]</code> and <code>argv[2]</code>). We use system call <code>open()</code> to open the first file (the file being copied), and use system call <code>creat()</code> to create a file with name <code>argv[2]</code>. We use two integer variable to hold the file descriptor returned by this two system calls. If no error occurred, we use <code>read()</code> system call to read content in <code>file_1</code> to our buffer, then use <code>write()</code> system call to write content in our buffer to the file. If there is any error occurred during the writing process (i.e. the returned value of <code>write()</code> is different from the intended value), we display error.
</p>

<p>
In this first version,we call <code>printf()</code> to display error message through standard output, and call <code>exit(1)</code> to exit the program. The code is as follows:
</p>
<div class="org-src-container">
<pre class="src src-c">#include &lt;stdio.h&gt;   // for displaying error message
#include &lt;stdlib.h&gt;  // for exit() function
#include &lt;unistd.h&gt;  // for read(), write()
#include &lt;fcntl.h&gt;   // for open(), creat()
#define PERMS 0666   // default permission flag for copied file
		     // RW for owner, group, others
#define BUFFER 100   // buffer size for a single call of read()

/* cp: copy f1 to f2 */                    
int main(int argc, char *argv[]) {
  int fd1, fd2;  // hold two file descriptors
  int n;  // hold number of bytes read from file1
  char buf[BUFFER];

  // check number of command line arguments
  if (argc != 3) {
    printf("Usage: cp f1 f2");
    exit(1);
  }

  // oepn first file and create second file, exit if error occurred
  if ((fd1 = open(argv[1], O_RDONLY, 0)) == -1) {  // open failed
    printf("Error: can't open %s\n", argv[1]);
    exit(1);
  }

  if ((fd2 = creat(argv[2], PERMS)) == -1) {  // create failed
    printf("Error: can't create %s\n", argv[2]);
    exit(1);
  }

  // use read() and write() system to copy file
  while ((n = read(fd1, buf, BUFFER)) &gt; 0)
    if (n != write(fd2, buf, n)) {  // check if write succeeded
      printf("Error: couldn't write on file %s\n", argv[2]);
      exit(1);
    }

  return 0;
}                    
</pre>
</div>
</div>
</div>
<div id="outline-container-org6728877" class="outline-4">
<h4 id="org6728877"><span class="section-number-4">5.3.6</span> Example: mini <code>cp</code> program with self-implemented <code>error()</code> display</h4>
<div class="outline-text-4" id="text-5-3-6">
<p>
Here, we implement a function called <code>error()</code> to combine following function calls:
</p>
<ol class="org-ol">
<li><code>printf("...", argv[...])</code></li>
<li><code>exit(1)</code></li>
</ol>

<p>
In short, it will display error information to standard error file, then call <code>exit(1)</code> to stop the program.
</p>

<p>
This is similar with the simple <code>printf()</code> function we built <a href="#org908efcd">earlier</a>. It is a function with variable-length argument lists. To process this kind of function, we <code>#include &lt;stdarg.h&gt;</code>, and the header is:
</p>
<div class="org-src-container">
<pre class="src src-c">void error(char *format, ...)
</pre>
</div>
<p>
The three dots represents this function may have variable-length argument(s) after the named argument <code>format</code>. To navigate each un-named argument, we declare a <code>va_list</code> type object and initialize it:
</p>
<div class="org-src-container">
<pre class="src src-c">#include &lt;stdarg.h&gt;

void error(char *format, ...) {
  va_list args;
  va_start(args, format);
}
</pre>
</div>

<p>
Then, we use <code>fprintf()</code> to print error message to <code>stderr</code> (this is a file pointer):
</p>
<div class="org-src-container">
<pre class="src src-c">fprintf(stderr, "error: ");
vfprintf(stderr, format, args);
fprintf(stderr, '\n');
</pre>
</div>

<p>
Here, we use other version of <code>fprintf()</code> to print the argument related error message: <code>vfprintf()</code>. Its header is as follows:
</p>
<div class="org-src-container">
<pre class="src src-c">int vfprintf(FILE *fp, const char *format, va_list arg);
</pre>
</div>

<p>
<b>Parameters</b>
</p>

<ul class="org-ul">
<li><code>fp</code>: pointer to a <code>FILE</code> object that identifies an output stream</li>
<li><code>format</code>: C string that contains a format string that follows the same specifications as in <code>printf()</code></li>
<li><code>arg</code> a variable of <code>va_list</code> type which has been initialized by calling the <code>va_start</code> macro.</li>
</ul>

<p>
<b>Return Value</b>
</p>

<p>
If succeed, the total number of characters written is returned.
</p>

<p>
<b>Behavior</b>
</p>

<p>
Writes the C string pointed by <code>format</code> to the file pointed by <code>fp</code>, replacing any format specifier in the same way as <code>printf()</code> does, using the elements in the variable argument list identified by <code>arg</code>, which is a <code>va_list</code> type object initialized by the <code>va_start</code> macro. So, we don't have to manually scan the <code>format</code> string and when a <code>'%'</code> is found, call <code>va_arg()</code> to retrieve the next argument in <code>arg</code> and print according to its type (check <a href="#org908efcd">miniPrintf()</a> for details of how this is done).
</p>

<p>
In another words, this function is like automatically extracting all arguments in <code>arg</code> and call:
</p>
<div class="org-src-container">
<pre class="src src-c">fprintf(stderr, format, arg1, arg2, arg3);
</pre>
</div>

<p>
After displaying error message, we call <code>va_end()</code> macro to end the argument retrieving. Then we call <code>exit(1)</code> to stop the program. The combined code is as follows:
</p>
<div class="org-src-container">
<pre class="src src-c">#include &lt;stdio.h&gt;
#include &lt;stdarg.h&gt;
#include &lt;stdlib.h&gt;  // for exit() function

void error(char *format, ...) {
  va_list args;  // for retrieving arguments
  va_start(args, format);  // initialize args

  // print error messages
  fprintf(stderr, "error: ");
  vfprintf(stderr, format, args);
  fprintf(stderr, "\n");

  // call exit() to stop the program
  exit(1);
}
</pre>
</div>

<p>
Now <code>error()</code> has been defined, we call <code>error()</code> directly when an error occurred, instead of <code>printf()</code> and <code>exit()</code>. The code is as follows:
</p>
<div class="org-src-container">
<pre class="src src-c">#include &lt;stdio.h&gt;
#include &lt;stdarg.h&gt;
#include &lt;stdlib.h&gt;
#include &lt;fcntl.h&gt;
#include &lt;unistd.h&gt;

#define PERMS 0666  // permission code: RW for owner, group, others
#define BUFFSIZE 100  // buffer size for read(), write()

void error(char *format, ...);

int main(int argc, char *argv[]) {
  int f1, f2, n;
  char buf[BUFFSIZE];

  // try to open files and display error message if failed
  if (argc != 3)  // check command line argument amount
    error("Usage: cp from to");
  if ((f1 = open(argv[1], O_RDONLY, 0)) == -1)
    error("cp: can't open %s", argv[1]);
  if ((f2 = creat(argv[2], PERMS)) == -1)
    error("cp: can't create %s, mode%03o", argv[2], PERMS);

  // copy
  while ((n = read(f1, buf, BUFFSIZE)) &gt; 0)
    if (write(f2, buf, n) != n)
      error("cp: write error on file %s", argv[2]);

  return 0;
}
</pre>
</div>
</div>
</div>
