Computer Science/C Notes/C_notes.org
*** Exercise: mini ~cat~ program
This is exercise 8-1 in the textbook. The behavior of ~cat~ is:
- if no other file name provided as command line arguments, read from standard input and write to standard output file.
- if other file name provided as command line arguments, read from each file and write to standard output file.
- if error occured, use ~error()~ to print error message and stop the program

The code is as follows (with simple explanations)
#+begin_src c
#include <stdio.h>  // for stdin, stderr, stdout file pointers
#include <unistd.h>  // for read(), write()
#include <stdlib.h>  // for exit()
#include <stdarg.h>  // for variant-length argument function error()
#include <fcntl.h>  // for open() mode flags

#define BUFFSIZE 100

void error(char *format, ...);

int main(int argc, char *argv[]) {

  char buf[BUFFSIZE];  // buffer for read(), write()
  int n;  // count byte number
  int fd;  // to hold input file descriptor
  
  // check number of arguments
  if (argc == 1) {  // copy stdin to stdout
    while ((n = read(0, buf, BUFFSIZE)) > 0)
      if (n != write(1, buf, n))
        error("cat: write error to standard output");
    if (n == -1)
      error("cat: read error from standard input");
  } else {
    while (--argc > 0) {
      // try to open file
      if ((fd = open(*++argv, O_RDONLY, 0)) == -1)
        error("cat: can't open %s", *(argv));
      // write to file 
      while ((n = read(fd, buf, BUFFSIZE)) > 0)
        if (n != write(1, buf, n))
          error("cat: write error to standard output");
      if (n == -1)
        error("cat: read error from file %s", *(--argv));
      close(fd);  // free fd, so it is ready for next file 
    }
  }
  
  
  return 0;
}

void error(char *format, ...) {
  va_list args;
  va_start(args, format);
  
  fprintf(stderr, "Error: ");
  vfprintf(stderr, format, args);
  fprintf(stderr, "\n");
  
  va_end(args);
  exit(1);
}
#+end_src
** Random Access: ~lseek()~
The system call ~lseek()~ provides a way to move around in a file without reading or writing any data.
*** ~lseek()~
The header of ~lseek()~ is as follows:
#+begin_src c
long lseek(int fd, long offset, int origin);
#+end_src

*Parameters*

- ~fd~: the file descriptor which referring the file that are being worked with
- ~offset~: number of bytes that ~lseek()~ offsets the current position.
- ~origin~: the code for the position used as relative starting point to measure ~offset~. ~origin~ can have following values:
  - 0: ~offset~ is to be measured from the beginning
  - 1: ~offset~ is to be measured from the current position
  - 2: ~offset~ is to be measured from the end

*Return Value*

If no error occurred, returns a ~long~ that gives the new position in the file. Return -1 if an error occurs.

*Behavior*

After calling this function, the current working position of file referred by ~fd~ will be moved to the new position (affects system calls like ~read()~ and ~write()~). Pay attention that if position is beyond the range of the file, ~read()~ will have error, ~write()~ will add ~null~ between the end of file to the beginning of newly written content.
*** Examples
If we want to append data to the end of a file, we open a file in a mode that supports write, then call ~lseek(fd, 0L, 2)~, so the current working position will move to end of file.

To get back to beginning (~rewind()~), we just need to call ~lseek(fd, 0L, 0)~.
** Example: an implementation of ~fopen()~ and ~getc()~
 In this section we build a ~FILE~ type from scratch and implement ~fopen()~ and ~gect()~. We can use what we build to access files through ~FILE~ type, not the file descriptor (file descriptors are buried in the back stage).
 
*** ~FILE~ type build-up and Macros
Files in the standard library are described by file pointers rather than file descriptors. A file pointer is a pointer to a structure which is defined as a ~FILE~ type with a ~typedef~, it contains information about a file:
- a pointer to a buffer
  - a buffer is used so file can be read in large chunks
- a count of the number of characters left in the buffer
- a pointer to the next character position in the buffer
- the file descriptor
- flags describing:
  - file openning mode: read or write
  - error states: if error has occurred
  - EOF states: whether end of file has occurred

The code is as follows:
#+begin_src c
// named constants
#define NULL      0
#define EOF       (-1)
#define BUFSIZ    1024    //buffer size
#define OPEN_MAX  20      // max number of files open at once

typedef struct _iobuf {
  int cnt;           // characters left in the buffer
  char *ptr;         // next character position in the buffer
  char *base;        // location of buffer 
  int flag;          // store info bits (mode of file access and other status)
  int fd;            // file descriptor
} FILE;

FILE _iob[OPEN_MAX];       // an array of FILE type structures, each element is a FILE

// named constants
#define stdin  (&_iob[0])  // pointer to _iob[0]
#define stdout (&_iob[1])  // pointer to _iob[1]
#define stderr (&_iob[2])  // pointer to _iob[2]

/*Notes: 
In the FILE structure, we use only one integer flag to record the status bit, thus a single integer can record multiple status (each bit is a flag)
*/
enum _flags {     /* a leading zero on an integer constant means octal */
  _READ  = 01,    /* file open for reading */
  _WRITE = 02,    /* file open for writing */
  _UNBUF = 04,    /* file is unbuffered */
  _EOF   = 010,   /* EOF has occurred on this file */
  _ERR   = 020    /* error occurred on this file */
};

int _fillbuf(FILE *);         // function header
int _flushbuf(int, FILE *);   // function header

// macros with arguments, argument type should be pointer to FILE structure
#define feof(p) (((p)->flag & _EOF) != 0)       // when EOF has occurred, this is true
#define ferror(p) (((p)->flag & _ERR) != 0)     //when error occurred, this is true
#define fileno(p) ((p)->fd)                     // get the file descriptor

#define getc(p) (--(p)->cnt >= 0 ? (unsigned char) *(p)->ptr++ : _fillbuf(p))
#define putc(x,p) (--(p)->cnt >= 0 ? *(p)->ptr++ = (x) : _flushbuf((x), p))

#define getchar() getc(stdin)
#define putchar(x)  putc((x), stdout)
#+end_src


