Computer Science/C Notes/C_notes.html
<div id="outline-container-org531607d" class="outline-4">
<h4 id="org531607d"><span class="section-number-4">5.3.7</span> Exercise: mini <code>cat</code> program</h4>
<div class="outline-text-4" id="text-5-3-7">
<p>
This is exercise 8-1 in the textbook. The behavior of <code>cat</code> is:
</p>
<ul class="org-ul">
<li>if no other file name provided as command line arguments, read from standard input and write to standard output file.</li>
<li>if other file name provided as command line arguments, read from each file and write to standard output file.</li>
<li>if error occured, use <code>error()</code> to print error message and stop the program</li>
</ul>

<p>
The code is as follows (with simple explanations)
</p>
<div class="org-src-container">
<pre class="src src-c">#include &lt;stdio.h&gt;  // for stdin, stderr, stdout file pointers
#include &lt;unistd.h&gt;  // for read(), write()
#include &lt;stdlib.h&gt;  // for exit()
#include &lt;stdarg.h&gt;  // for variant-length argument function error()
#include &lt;fcntl.h&gt;  // for open() mode flags

#define BUFFSIZE 100

void error(char *format, ...);

int main(int argc, char *argv[]) {

  char buf[BUFFSIZE];  // buffer for read(), write()
  int n;  // count byte number
  int fd;  // to hold input file descriptor

  // check number of arguments
  if (argc == 1) {  // copy stdin to stdout
    while ((n = read(0, buf, BUFFSIZE)) &gt; 0)
      if (n != write(1, buf, n))
	error("cat: write error to standard output");
    if (n == -1)
      error("cat: read error from standard input");
  } else {
    while (--argc &gt; 0) {
      // try to open file
      if ((fd = open(*++argv, O_RDONLY, 0)) == -1)
	error("cat: can't open %s", *(argv));
      // write to file 
      while ((n = read(fd, buf, BUFFSIZE)) &gt; 0)
	if (n != write(1, buf, n))
	  error("cat: write error to standard output");
      if (n == -1)
	error("cat: read error from file %s", *(--argv));
      close(fd);  // free fd, so it is ready for next file 
    }
  }


  return 0;
}

void error(char *format, ...) {
  va_list args;
  va_start(args, format);

  fprintf(stderr, "Error: ");
  vfprintf(stderr, format, args);
  fprintf(stderr, "\n");

  va_end(args);
  exit(1);
}
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org7fa7a54" class="outline-3">
<h3 id="org7fa7a54"><span class="section-number-3">5.4</span> Random Access: <code>lseek()</code></h3>
<div class="outline-text-3" id="text-5-4">
<p>
The system call <code>lseek()</code> provides a way to move around in a file without reading or writing any data.
</p>
</div>
<div id="outline-container-org31c5f1e" class="outline-4">
<h4 id="org31c5f1e"><span class="section-number-4">5.4.1</span> <code>lseek()</code></h4>
<div class="outline-text-4" id="text-5-4-1">
<p>
The header of <code>lseek()</code> is as follows:
</p>
<div class="org-src-container">
<pre class="src src-c">long lseek(int fd, long offset, int origin);
</pre>
</div>

<p>
<b>Parameters</b>
</p>

<ul class="org-ul">
<li><code>fd</code>: the file descriptor which referring the file that are being worked with</li>
<li><code>offset</code>: number of bytes that <code>lseek()</code> offsets the current position.</li>
<li><code>origin</code>: the code for the position used as relative starting point to measure <code>offset</code>. <code>origin</code> can have following values:
<ul class="org-ul">
<li>0: <code>offset</code> is to be measured from the beginning</li>
<li>1: <code>offset</code> is to be measured from the current position</li>
<li>2: <code>offset</code> is to be measured from the end</li>
</ul></li>
</ul>

<p>
<b>Return Value</b>
</p>

<p>
If no error occurred, returns a <code>long</code> that gives the new position in the file. Return -1 if an error occurs.
</p>

<p>
<b>Behavior</b>
</p>

<p>
After calling this function, the current working position of file referred by <code>fd</code> will be moved to the new position (affects system calls like <code>read()</code> and <code>write()</code>). Pay attention that if position is beyond the range of the file, <code>read()</code> will have error, <code>write()</code> will add <code>null</code> between the end of file to the beginning of newly written content.
</p>
</div>
</div>
<div id="outline-container-org61a2393" class="outline-4">
<h4 id="org61a2393"><span class="section-number-4">5.4.2</span> Examples</h4>
<div class="outline-text-4" id="text-5-4-2">
<p>
If we want to append data to the end of a file, we open a file in a mode that supports write, then call <code>lseek(fd, 0L, 2)</code>, so the current working position will move to end of file.
</p>

<p>
To get back to beginning (<code>rewind()</code>), we just need to call <code>lseek(fd, 0L, 0)</code>.
</p>
</div>
</div>
</div>
<div id="outline-container-org2d3f59e" class="outline-3">
<h3 id="org2d3f59e"><span class="section-number-3">5.5</span> Example: an implementation of <code>fopen()</code> and <code>getc()</code></h3>
<div class="outline-text-3" id="text-5-5">
<p>
In this section we build a <code>FILE</code> type from scratch and implement <code>fopen()</code> and <code>gect()</code>. We can use what we build to access files through <code>FILE</code> type, not the file descriptor (file descriptors are buried in the back stage).
</p>
</div>


<div id="outline-container-orgbd5a50f" class="outline-4">
<h4 id="orgbd5a50f"><span class="section-number-4">5.5.1</span> <code>FILE</code> type build-up and Macros</h4>
<div class="outline-text-4" id="text-5-5-1">
<p>
Files in the standard library are described by file pointers rather than file descriptors. A file pointer is a pointer to a structure which is defined as a <code>FILE</code> type with a <code>typedef</code>, it contains information about a file:
</p>
<ul class="org-ul">
<li>a pointer to a buffer
<ul class="org-ul">
<li>a buffer is used so file can be read in large chunks</li>
</ul></li>
<li>a count of the number of characters left in the buffer</li>
<li>a pointer to the next character position in the buffer</li>
<li>the file descriptor</li>
<li>flags describing:
<ul class="org-ul">
<li>file openning mode: read or write</li>
<li>error states: if error has occurred</li>
<li>EOF states: whether end of file has occurred</li>
</ul></li>
</ul>

<p>
The code is as follows:
</p>
<div class="org-src-container">
<pre class="src src-c">// named constants
#define NULL      0
#define EOF       (-1)
#define BUFSIZ    1024    //buffer size
#define OPEN_MAX  20      // max number of files open at once

typedef struct _iobuf {
  int cnt;           // characters left in the buffer
  char *ptr;         // next character position in the buffer
  char *base;        // location of buffer 
  int flag;          // store info bits (mode of file access and other status)
  int fd;            // file descriptor
} FILE;

FILE _iob[OPEN_MAX];       // an array of FILE type structures, each element is a FILE

// named constants
#define stdin  (&amp;_iob[0])  // pointer to _iob[0]
#define stdout (&amp;_iob[1])  // pointer to _iob[1]
#define stderr (&amp;_iob[2])  // pointer to _iob[2]

/*Notes: 
In the FILE structure, we use only one integer flag to record the status bit, thus a single integer can record multiple status (each bit is a flag)
*/
enum _flags {     /* a leading zero on an integer constant means octal */
  _READ  = 01,    /* file open for reading */
  _WRITE = 02,    /* file open for writing */
  _UNBUF = 04,    /* file is unbuffered */
  _EOF   = 010,   /* EOF has occurred on this file */
  _ERR   = 020    /* error occurred on this file */
};

int _fillbuf(FILE *);         // function header
int _flushbuf(int, FILE *);   // function header

// macros with arguments, argument type should be pointer to FILE structure
#define feof(p) (((p)-&gt;flag &amp; _EOF) != 0)       // when EOF has occurred, this is true
#define ferror(p) (((p)-&gt;flag &amp; _ERR) != 0)     //when error occurred, this is true
#define fileno(p) ((p)-&gt;fd)                     // get the file descriptor

#define getc(p) (--(p)-&gt;cnt &gt;= 0 ? (unsigned char) *(p)-&gt;ptr++ : _fillbuf(p))
#define putc(x,p) (--(p)-&gt;cnt &gt;= 0 ? *(p)-&gt;ptr++ = (x) : _flushbuf((x), p))

#define getchar() getc(stdin)
#define putchar(x)  putc((x), stdout)
</pre>
</div>
</div>
