Computer Science/C Notes/C_notes.org
**** Setting flags

Notice that we have a member in ~FILE~ structure named ~flag~. This single integer is used to record various status of the ~FILE~ object. Each bit of the inter represents true/false of a specific status. We defined the status in the ~enum~ type:
#+begin_src c
enum _flags {     /* a leading zero on an integer constant means octal */
  _READ  = 01,    /* file open for reading */
  _WRITE = 02,    /* file open for writing */
  _UNBUF = 04,    /* file is unbuffered */
  _EOF   = 010,   /* EOF has occurred on this file */
  _ERR   = 020    /* error occurred on this file */
};
#+end_src

To make it clearer, we translate these octal number to binary to see which bit corresponds which information:
#+BEGIN_EXAMPLE
00001: read enabled
00010: write enabled
00100: file is unbuffered
01000: EOF reached
10000: error encountered
#+END_EXAMPLE
To check if ~flag~ has any of the above bit set, we just simplily use ~&~, as shown in macros ~feof()~, ~ferror()~, ~fileno()~.

**** Macro ~getc()~

In standard library, ~getc(p)~ accepts a pointer to a ~FILE~ object, returns the next character from the file.

In our implementation, to reduce the number of system calls, every required character was first looked in buffer. We first check if ~cnt~ is 0. This is an integer in ~FILE~ structure recording the number of remaining characters in the buffer. If this is zero, it means the buffer has gone empty. We call function ~_fillbuf(p)~ to fill the buffer (the buffer is filled by data retrieved from file via ~read()~ system call). If its not zero, we give the next character (pointed by ~ptr~ in ~FILE~ structure). The character returned is cast into ~unsigned char~ type to ensure that all characters will be positive.

Macro ~getchar()~ is also declared, by changing ~getc(p)~ to ~getc(stdin)~.

**** Macro ~putc()~

In standard library, ~putc(x,p)~ accepts a character ~x~ and a pointer ~p~ to a ~FILE~ object. It will write ~x~ to the file and returns the ~x~.

In our implementation, to reduce the number of system calls, every character that is intended to be written into file goes to buffer first (we add it to buffer). In this case, ~cnt~ represents the number of free slots in the buffer. First we check if the buffer is full or not. If it is not full (it can still hold additional characters), we push add the character to the position pointed by ~ptr~ and update ~ptr~'s position. If the buffer is already full, we call function ~_flushbuf((x), p)~ to flush the buffer (call ~write()~ to transfer characters in buffer to the file).

Macro ~putchar()~ is also declared, by changing ~putc(x,p)~ to ~putc((x), stdout)~.

*** ~fopen()~


* Place Holder
