Computer Science/C Notes/C_notes.html


<div id="outline-container-orgd44a713" class="outline-5">
<h5 id="orgd44a713"><span class="section-number-5">5.5.1.1</span> Setting flags</h5>
<div class="outline-text-5" id="text-5-5-1-1">
<p>
Notice that we have a member in <code>FILE</code> structure named <code>flag</code>. This single integer is used to record various status of the <code>FILE</code> object. Each bit of the inter represents true/false of a specific status. We defined the status in the <code>enum</code> type:
</p>
<div class="org-src-container">
<pre class="src src-c">enum _flags {     /* a leading zero on an integer constant means octal */
  _READ  = 01,    /* file open for reading */
  _WRITE = 02,    /* file open for writing */
  _UNBUF = 04,    /* file is unbuffered */
  _EOF   = 010,   /* EOF has occurred on this file */
  _ERR   = 020    /* error occurred on this file */
};
</pre>
</div>

<p>
To make it clearer, we translate these octal number to binary to see which bit corresponds which information:
</p>
<pre class="example">
00001: read enabled
00010: write enabled
00100: file is unbuffered
01000: EOF reached
10000: error encountered
</pre>
<p>
To check if <code>flag</code> has any of the above bit set, we just simplily use <code>&amp;</code>, as shown in macros <code>feof()</code>, <code>ferror()</code>, <code>fileno()</code>.
</p>
</div>
</div>

<div id="outline-container-org2b2b3ea" class="outline-5">
<h5 id="org2b2b3ea"><span class="section-number-5">5.5.1.2</span> Macro <code>getc()</code></h5>
<div class="outline-text-5" id="text-5-5-1-2">
<p>
In standard library, <code>getc(p)</code> accepts a pointer to a <code>FILE</code> object, returns the next character from the file.
</p>

<p>
In our implementation, to reduce the number of system calls, every required character was first looked in buffer. We first check if <code>cnt</code> is 0. This is an integer in <code>FILE</code> structure recording the number of remaining characters in the buffer. If this is zero, it means the buffer has gone empty. We call function <code>_fillbuf(p)</code> to fill the buffer (the buffer is filled by data retrieved from file via <code>read()</code> system call). If its not zero, we give the next character (pointed by <code>ptr</code> in <code>FILE</code> structure). The character returned is cast into <code>unsigned char</code> type to ensure that all characters will be positive.
</p>

<p>
Macro <code>getchar()</code> is also declared, by changing <code>getc(p)</code> to <code>getc(stdin)</code>.
</p>
</div>
</div>

<div id="outline-container-org472871c" class="outline-5">
<h5 id="org472871c"><span class="section-number-5">5.5.1.3</span> Macro <code>putc()</code></h5>
<div class="outline-text-5" id="text-5-5-1-3">
<p>
In standard library, <code>putc(x,p)</code> accepts a character <code>x</code> and a pointer <code>p</code> to a <code>FILE</code> object. It will write <code>x</code> to the file and returns the <code>x</code>.
</p>

<p>
In our implementation, to reduce the number of system calls, every character that is intended to be written into file goes to buffer first (we add it to buffer). In this case, <code>cnt</code> represents the number of free slots in the buffer. First we check if the buffer is full or not. If it is not full (it can still hold additional characters), we push add the character to the position pointed by <code>ptr</code> and update <code>ptr</code>'s position. If the buffer is already full, we call function <code>_flushbuf((x), p)</code> to flush the buffer (call <code>write()</code> to transfer characters in buffer to the file).
</p>

<p>
Macro <code>putchar()</code> is also declared, by changing <code>putc(x,p)</code> to <code>putc((x), stdout)</code>.
</p>
</div>
</div>
</div>

<div id="outline-container-orgf55ba3e" class="outline-4">
<h4 id="orgf55ba3e"><span class="section-number-4">5.5.2</span> <code>fopen()</code></h4>
</div>
</div>
</div>


<div id="outline-container-orge39320e" class="outline-2">
<h2 id="orge39320e"><span class="section-number-2">6</span> Place Holder</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2019-08-27 Tue 18:50</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
